//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("СписокРегламентныхЗаданий")
		.ДобавитьТест("ДанныеРегламентногоЗадания")
		.ДобавитьТест("НастроитьРегламентноеЗадание")
		
		.ДобавитьТест("ЗапуститьРегламентноеЗадание")
		.ДобавитьТест("ОстановитьРегламентноеЗадание")
		.ДобавитьТест("ПерезапуститьРегламентноеЗадание")
		
		.ДобавитьТест("ФоновоеЗадание")
		.ДобавитьТест("ЗавершитьФоновоеЗадание")
		.ДобавитьТест("АктивноеФоновоеЗаданиеРегламентного")
		
		.ДобавитьТест("ЗапросAPI")
		.ДобавитьТест("Сервис_АктивноеФоновоеЗаданиеРегламентного")
		.ДобавитьТест("Сервис_ЗапуститьРегламентноеЗаданиеОшибка")
	;
	
КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт
	
	ВыключитьРегламентныеЗадания();
	НастроитьРегламентныеЗадания();
	
КонецПроцедуры

Процедура ПослеВсехТестов() Экспорт
	
	ВыключитьРегламентныеЗадания();
	
КонецПроцедуры

Процедура СписокРегламентныхЗаданий() Экспорт
	
	КлассыОшибок = РатОбщий.КлассыОшибок();
	Обработчик = "СписокРегламентныхЗаданий";
	
	Описание = "Получение списка РЗ";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыПолученияСписка());
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.ИмеетТип("Массив")
		.Заполнено();
		
	Описание = "Получение списка РЗ с отбором";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыПолученияСписка(МетаданныеРегламентногоЗадания().Имя));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.ИмеетТип("Массив")
		.Заполнено();
	
	ЮТест.ОжидаетЧто(Статус.Результат[0], Описание + ". Элемент списка РЗ")
		.ИмеетТип("Структура")
		.Свойство("Метаданные").Равно(МетаданныеРегламентногоЗадания().Имя);
	
	Описание = "Получение списка РЗ с отбором по несуществующему наименованию";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыПолученияСписка(, Строка(Новый УникальныйИдентификатор())));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.НеЗаполнено();
		
	Статус = ВызватьОбработчикЗапроса(Обработчик, Новый Структура("Параметры", Новый Структура("Задание", 1)));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, "Некорректный отбор", КлассыОшибок.АнализПараметровЗапроса);
	
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыПолученияСписка(, , 1));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, "Некорректный формат идентификатора", КлассыОшибок.Десериализация);
	
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыПолученияСписка("Атошь"));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, "Неизвестное имя метаданных", КлассыОшибок.АнализПараметровЗапроса);
	
КонецПроцедуры

Процедура ДанныеРегламентногоЗадания() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	МетаданныеРегламентногоЗадания = МетаданныеРегламентногоЗадания().Имя;
	КлассыОшибок = РатОбщий.КлассыОшибок();
	Обработчик = "ДанныеРегламентногоЗадания";
	
	Описание = "Получение регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ИдентификаторЗадания(ИмяРегламентногоЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("Наименование", ИмяРегламентногоЗадания)
		.Свойство("Метаданные", МетаданныеРегламентногоЗадания);
	
	Описание = "Получение неизвестного регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ИдентификаторЗадания("1"));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, Описание, КлассыОшибок.НеНайденаЗаписьИБ);
	
	// TODO различные варианты идентификации РЗ
	
КонецПроцедуры

Процедура НастроитьРегламентноеЗадание() Экспорт
	
	КлассыОшибок = РатОбщий.КлассыОшибок();
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	НовоеИмяРегламентногоЗадания = "Новый " + ИмяРегламентногоЗадания;
	Обработчик = "НастроитьРегламентноеЗадание";
	
	Расписание = Новый Структура("ДеньВМесяце, ПериодНедель, Месяцы, ДетальныеРасписанияДня, ДатаКонца", 2, 1, РатКоллекции.ЗначениеВМассиве(1,12));
	ДанныеЗадания = Новый Структура("Использование, Расписание, Наименование", Ложь, Расписание, НовоеИмяРегламентногоЗадания);
	
	Описание = "Настройка регламентного задания";
	ПараметрыЗапроса = ИдентификаторЗадания(ИмяРегламентногоЗадания);
	ПараметрыЗапроса.Вставить("Тело", ДанныеЗадания);
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапроса);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	
	РегламентноеЗадание = РегламентноеЗадание(НовоеИмяРегламентногоЗадания);
	ЮТест.ОжидаетЧто(РегламентноеЗадание, Описание + ". Проверка результата")
		.Свойство("Наименование").Равно(НовоеИмяРегламентногоЗадания)
		.Свойство("Использование").Равно(ДанныеЗадания.Использование)
		.Свойство("Расписание.ДеньВМесяце").Равно(ДанныеЗадания.Расписание.ДеньВМесяце)
		.Свойство("Расписание.Месяцы").Равно(ДанныеЗадания.Расписание.Месяцы)
		.Свойство("Расписание.ДатаКонца").Равно('00010101')
		.Свойство("Расписание.ДетальныеРасписанияДня").ИмеетДлину(0);
	
	Описание = "Повторная настройка регламентного задания";
	ПараметрыЗапроса = ИдентификаторЗадания(ИмяРегламентногоЗадания);
	ПараметрыЗапроса.Вставить("Тело", ДанныеЗадания);
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапроса);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, Описание, КлассыОшибок.НеНайденаЗаписьИБ);
	
КонецПроцедуры

Процедура ЗапуститьРегламентноеЗадание() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	КлассыОшибок = РатОбщий.КлассыОшибок();
	Обработчик = "ЗапуститьРегламентноеЗадание";
	
	Описание = "Запуск регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапуска(ИмяРегламентногоЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("ИнформацияОбОшибке").НеЗаполнено()
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Активно);
	
	Описание = "Запуск несуществующего регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапуска(Новый УникальныйИдентификатор()));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, Описание, КлассыОшибок.НеНайденаЗаписьИБ);
	
	Описание = "Запуск регламентного задания без ожидания завершения";
	Параметры = ПараметрыЗапуска(ИмяРегламентногоЗадания, 0);
	Статус = ВызватьОбработчикЗапроса(Обработчик, Параметры);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Активно);
	
	Описание = "Запуск регламентного задания и ожидание завершения";
	Параметры = ПараметрыЗапуска(ИмяРегламентногоЗадания, 200);
	Статус = ВызватьОбработчикЗапроса(Обработчик, Параметры);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Завершено);
	
	Описание = "Запуск регламентного задания с малым времен ожидания завершения";
	Параметры = ПараметрыЗапуска(ИмяРегламентногоЗадания, 1);
	Статус = ВызватьОбработчикЗапроса(Обработчик, Параметры);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Активно);
	
КонецПроцедуры

Процедура ОстановитьРегламентноеЗадание() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	ОбработчикЗапуск = "ЗапуститьРегламентноеЗадание";
	Обработчик = "ОстановитьРегламентноеЗадание";
	
	Статус = ВызватьОбработчикЗапроса(ОбработчикЗапуск, ПараметрыЗапуска(ИмяРегламентногоЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Запуск регламентного задания");
	
	Описание = "Остановка регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ИдентификаторЗадания(ИмяРегламентногоЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.ИмеетТип("Массив")
		.Заполнено();
	ЮТест.ОжидаетЧто(Статус.Результат[0], Описание + ". Остановленное задание")
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Отменено);
	
КонецПроцедуры

Процедура АктивноеФоновоеЗаданиеРегламентного() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	КлассыОшибок = РатОбщий.КлассыОшибок();
	ОбработчикЗапуск = "ЗапуститьРегламентноеЗадание";
	Обработчик = "АктивноеФоновоеЗаданиеРегламентного";
	
	Статус = ВызватьОбработчикЗапроса(ОбработчикЗапуск, ПараметрыЗапуска(ИмяРегламентногоЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Запуск регламентного задания");
	
	Описание = "Получение активного фонового для регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ИдентификаторЗадания(ИмяРегламентногоЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус, Описание + ". Проверка результата")
		.Свойство("КодСостояния").НеРавно(204)
		.Свойство("Результат.Состояние").Равно(СостояниеФоновогоЗадания.Активно);
	
	Описание = "Получение активного фонового для несуществующего регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ИдентификаторЗадания("СлияниеПолнотекстовогоИндекса"));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, Описание, КлассыОшибок.НеНайденаЗаписьИБ);
	
	Описание = "Получение активного фонового для завершенного регламентного задания";
	Статус = ВызватьОбработчикЗапроса("ОстановитьРегламентноеЗадание", ИдентификаторЗадания(ИмяРегламентногоЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание + ". Остановка");
	
	Статус = ВызватьОбработчикЗапроса(Обработчик, ИдентификаторЗадания(ИмяРегламентногоЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание + ". Получение активного");
	ЮТест.ОжидаетЧто(Статус, Описание + ". Проверка результата")
		.Свойство("КодСостояния").Равно(204)
		.Свойство("Результат").НеЗаполнено();
	
КонецПроцедуры

Процедура ПерезапуститьРегламентноеЗадание() Экспорт
	
	ОписаниеЗадания = РегламентноеЗаданиеПоУмолчанию();
	ИмяЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	Обработчик = "ПерезапуститьРегламентноеЗадание";
	
	Описание = "Перезапуск регламентного задания";
	Статус = ВызватьОбработчикЗапроса("ОстановитьРегламентноеЗадание", ИдентификаторЗадания(ИмяЗадания));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание + ". Первичная остановка");
	
	Описание = "Перезапуск регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапуска(ИмяЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("Остановлено").ИмеетТип("Массив")
		.Свойство("Остановлено").НеЗаполнено()
		.Свойство("Запущено").ИмеетТип("Структура")
		.Свойство("Запущено.Наименование").ЗаканчиваетсяНа(ОписаниеЗадания.Наименование);
	
	Описание = "Повторный перезапуск регламентного задания";
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапуска(ИмяЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("Остановлено").ИмеетТип("Массив")
		.Свойство("Остановлено").ИмеетДлину(1)
		.Свойство("Запущено").ИмеетТип("Структура")
		.Свойство("Запущено.Наименование").ЗаканчиваетсяНа(ОписаниеЗадания.Наименование);
	
КонецПроцедуры

Процедура ФоновоеЗадание() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	ОбработчикЗапуск = "ЗапуститьРегламентноеЗадание";
	Обработчик = "ФоновоеЗадание";
	
	Статус = ВызватьОбработчикЗапроса(ОбработчикЗапуск, ПараметрыЗапуска(ИмяРегламентногоЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Запуск регламентного задания");
	
	Описание = "Получение фонового задания";
	ИдентификаторФоновогоЗадания = Статус.Результат.УникальныйИдентификатор;
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапуска(ИдентификаторФоновогоЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("УникальныйИдентификатор").Равно(ИдентификаторФоновогоЗадания)
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Активно);
	
КонецПроцедуры

Процедура ЗавершитьФоновоеЗадание() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	ОбработчикЗапуск = "ЗапуститьРегламентноеЗадание";
	Обработчик = "ЗавершитьФоновоеЗадание";
	
	Статус = ВызватьОбработчикЗапроса(ОбработчикЗапуск, ПараметрыЗапуска(ИмяРегламентногоЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Запуск регламентного задания");
	
	Описание = "Завершение фонового задания";
	ИдентификаторФоновогоЗадания = Статус.Результат.УникальныйИдентификатор;
	Статус = ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапуска(ИдентификаторФоновогоЗадания, 0));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест.ОжидаетЧто(Статус.Результат, Описание + ". Проверка результата")
		.Свойство("УникальныйИдентификатор").Равно(ИдентификаторФоновогоЗадания)
		.Свойство("Состояние").Равно(СостояниеФоновогоЗадания.Отменено);
	
КонецПроцедуры

Процедура ЗапросAPI() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	
	Варианты = Новый Массив;
	Ключи = "Запрос, Описание";
	
	Запрос = ПомощникТестированияРат.СтруктураЗапроса();
	Запрос.ОтносительныйURL = "РегламентныеЗадания";
	Запрос.ПараметрыЗапроса.Вставить("Использование", "true");
	Варианты.Добавить(Новый Структура(Ключи, Запрос, "Список включенных РЗ"));
	
	Запрос = ПомощникТестированияРат.СтруктураЗапроса();
	Запрос.ОтносительныйURL = "РегламентныеЗадания/Наименование=" + ИмяРегламентногоЗадания;
	Запрос.HTTPМетод = "PUT";
	Запрос.УстановитьТелоКакСтрокуJSON(Новый Структура("Использование", Ложь));
	Варианты.Добавить(Новый Структура(Ключи, Запрос, "Настройка РЗ"));
	
	Для Каждого Вариант Из Варианты Цикл
		
		Результат = РатСервис.ЗапросAPI(Вариант.Запрос);
		ПомощникТестированияРат.ПроверитьОтвет(Результат, Вариант.Описание);
		
	КонецЦикла;
	
	// Перечитаем
	РегламентноеЗадание = РегламентноеЗадание(ИмяРегламентногоЗадания);
	ЮТест.ОжидаетЧто(РегламентноеЗадание, "Данные регламентного задания после обновления")
		.Свойство("Использование").ЭтоЛожь();
	
КонецПроцедуры

Процедура Сервис_АктивноеФоновоеЗаданиеРегламентного() Экспорт
	
	ИмяРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию().Наименование;
	
	Запрос = ЗапросGET(СтрШаблон("/РегламентныеЗадания/%1/ФоновоеЗадание", ИмяРегламентногоЗадания));
	
	Ответ = РатСервис.ЗапросAPI(Запрос);
	ПомощникТестированияРат.ПроверитьОтвет(Ответ, "Активное задание");
	ЮТест.ОжидаетЧто(Ответ.ПолучитьТелоКакСтроку())
		.ЭтоНеНеопределено();
	Запрос = ЗапросGET("/РегламентныеЗадания/НеизвестноеЗадание/ФоновоеЗадание");
	
	Ответ = РатСервис.ЗапросAPI(Запрос);
	ПомощникТестированияРат.ПроверитьОтвет(Ответ, "Несуществующее задание", 404);
	
КонецПроцедуры

Процедура Сервис_ЗапуститьРегламентноеЗаданиеОшибка() Экспорт
	
	Описание = ОписаниеРегламентногоЗадания("Произвольный алгоритм ошибка");
	Описание.Параметры.Добавить("ЮТОбщий.Пауза(2);ВызватьИсключение ""Ошибка""");
	НастроитьРегламентныеЗадания(Описание);
	
	Запрос = Запрос("POST", СтрШаблон("/РегламентныеЗадания/%1/Запустить", Описание.Наименование));
	
	Ответ = РатСервис.ЗапросAPI(Запрос);
	ПомощникТестированияРат.ПроверитьОтвет(Ответ, "Активное задание");
	ЮТест.ОжидаетЧто(Ответ.ПолучитьТелоКакСтроку())
		.ЭтоНеНеопределено();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НастроитьРегламентныеЗадания(Знач ОписаниеРегламентногоЗадания = Неопределено)
	
	Если ОписаниеРегламентногоЗадания = Неопределено Тогда
		ОписаниеРегламентногоЗадания = РегламентноеЗаданиеПоУмолчанию();
	КонецЕсли;
	
	РегламентноеЗадание = РегламентноеЗадание(ОписаниеРегламентногоЗадания.Наименование);
	
	Если РегламентноеЗадание = Неопределено Тогда
		РегламентноеЗадание = РегламентноеЗадание("Новый " + ОписаниеРегламентногоЗадания.Наименование);
	КонецЕсли;
	
	Если РегламентноеЗадание = Неопределено Тогда
		МетаданныеРегламентногоЗадания = МетаданныеРегламентногоЗадания(ОписаниеРегламентногоЗадания.Имя);
		РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеРегламентногоЗадания);
	КонецЕсли;
	
	РегламентноеЗадание.Наименование = ОписаниеРегламентногоЗадания.Наименование;
	РегламентноеЗадание.Ключ = СтрЗаменить(ОписаниеРегламентногоЗадания.Наименование, " ", "_");
	РегламентноеЗадание.Использование = Истина;
	РегламентноеЗадание.Параметры.Очистить();
	
	Для Каждого Параметр Из ОписаниеРегламентногоЗадания.Параметры Цикл
		РегламентноеЗадание.Параметры.Добавить(Параметр);
	КонецЦикла;
	
	Расписание = Новый РасписаниеРегламентногоЗадания();
	Расписание.ДатаНачала = ОписаниеРегламентногоЗадания.ДатаНачала;
	Расписание.ДатаКонца = Расписание.ДатаНачала + 100000;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = ОписаниеРегламентногоЗадания.Периодичность;
	
	ДетальныеРасписанияДня = Новый Массив();
	ДетальноеРасписанияДня = Новый РасписаниеРегламентногоЗадания();
	ДетальноеРасписанияДня.ВремяНачала = '00010101001000';
	ДетальноеРасписанияДня.ВремяКонца =  '00010101235959';
	ДетальноеРасписанияДня.ДатаНачала = ОписаниеРегламентногоЗадания.ДатаНачала;
	ДетальноеРасписанияДня.ДатаКонца = ДетальноеРасписанияДня.ДатаНачала + 100000;
	ДетальноеРасписанияДня.ПериодПовтораДней = 1;
	ДетальноеРасписанияДня.ПериодПовтораВТечениеДня = ОписаниеРегламентногоЗадания.Периодичность;
	ДетальныеРасписанияДня.Добавить(ДетальноеРасписанияДня);
	
	Расписание.ДетальныеРасписанияДня = ДетальныеРасписанияДня;
	
	РегламентноеЗадание.Расписание = Расписание;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

Процедура ВыключитьРегламентныеЗадания()
	
	НайденныеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	
	Для Каждого РегламентноеЗадание Из НайденныеРегламентныеЗадания Цикл
		РегламентноеЗадание.Использование = Ложь;
		РегламентноеЗадание.Записать();
		
	КонецЦикла;
	
	Для Каждого ФоновоеЗадание Из ФоновыеЗадания.ПолучитьФоновыеЗадания() Цикл
		ФоновоеЗадание.Отменить();
	КонецЦикла;
	
КонецПроцедуры

Функция МетаданныеРегламентногоЗадания(Имя = "Ф_ПроизвольныйАлгоритм")
	
	Возврат Метаданные.РегламентныеЗадания[Имя];
	
КонецФункции

Функция ОписаниеРегламентногоЗадания(Наименование)
	
	Описание = Новый Структура;
	Описание.Вставить("Имя", "Ф_ПроизвольныйАлгоритм");
	Описание.Вставить("Наименование", Наименование);
	Описание.Вставить("Параметры", Новый Массив);
	Описание.Вставить("Периодичность", 3600);
	Описание.Вставить("ДатаНачала", ТекущаяДатаСеанса() + 1000);
	
	Возврат Описание;
	
КонецФункции

Функция РегламентноеЗаданиеПоУмолчанию()
	
	Описание = ОписаниеРегламентногоЗадания("Произвольный алгоритм");
	Описание.Параметры.Добавить("ЮТОбщий.Пауза(6)");
	
	Возврат Описание;
	
КонецФункции

Функция РегламентноеЗадание(Наименование = Неопределено)
	
	Если Наименование = Неопределено Тогда
		Наименование = РегламентноеЗаданиеПоУмолчанию().Наименование;
	КонецЕсли;
	
	Отбор = Новый Структура("Наименование", Наименование);
	НайденныеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Если НайденныеРегламентныеЗадания.Количество() Тогда
		Возврат НайденныеРегламентныеЗадания[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ВызватьОбработчикЗапроса(Обработчик, ПараметрыЗапроса)
	
	Статус = ПомощникТестированияРат.Статус();
	ОбработчикВыполнен = Ложь;
	Результат = РатРегламентныеЗадания.ВызватьОбработчик(Обработчик, ПараметрыЗапроса, Статус, ОбработчикВыполнен);
	Статус.Результат = Результат;
	
	Возврат Статус;
	
КонецФункции

Функция ПараметрыПолученияСписка(МетаданныеРЗ = Неопределено, Наименование = Неопределено, Идентификатор = Неопределено)
	
	Параметры = Новый Структура();
	Если МетаданныеРЗ <> Неопределено Тогда
		Параметры.Вставить("Метаданные", МетаданныеРЗ);
	КонецЕсли;
	
	Если Наименование <> Неопределено Тогда
		Параметры.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	Если Идентификатор <> Неопределено Тогда
		Параметры.Вставить("УникальныйИдентификатор", Идентификатор);
	КонецЕсли;
	
	Возврат Новый Структура("Параметры", Параметры);
	
КонецФункции

Функция ИдентификаторЗадания(Идентификатор)
	
	Возврат Новый Структура("Идентификатор, Параметры", Идентификатор, Новый Соответствие());
	
КонецФункции

Функция ПараметрыЗапуска(Идентификатор, ВремяОжидания = Неопределено)
	
	Параметры = ИдентификаторЗадания(Идентификатор);
	Если ВремяОжидания <> Неопределено Тогда
		Параметры.Параметры.Вставить("ВремяОжидания", ВремяОжидания);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Функция Запрос(Метод, ОтносительныйURL)
	
	Запрос = ПомощникТестированияРат.СтруктураЗапроса();
	Запрос.ОтносительныйURL = ОтносительныйURL;
	Запрос.HTTPМетод = Метод;
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросGET(ОтносительныйURL)
	
	Возврат Запрос("GET", ОтносительныйURL);
	
КонецФункции

#КонецОбласти
