//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ИспользуетсяСборДанных_БезИнициализации")
		.ДобавитьТест("ИспользуетсяСборДанных_ПослеИнициализации")
		.ДобавитьТест("ЗафиксироватьЗаписьОбъекта_До_Инициализации")
		.ДобавитьТестовыйНабор("РатСборДанныхСлужебный.ЗаписьОбъектов").ВТранзакции()
			.ДобавитьТест("ЗаписьОбъектовСправочник")
			.ДобавитьТест("ЗаписьОбъектовДокумент")
			.ДобавитьТест("ЗаписьОбъектовПланВидовХарактеристик")
			.ДобавитьТест("ЗаписьОбъектовПланСчетов")
			.ДобавитьТест("ЗаписьОбъектовПланВидовРасчета")
			.ДобавитьТест("ЗаписьОбъектовПланОбмена")
			.ДобавитьТест("ЗаписьОбъектовБизнесПроцесс")
			.ДобавитьТест("ЗаписьОбъектовЗадача")
			.ДобавитьТест("ЗаписьОбъектовРегистрСведений")
			.ДобавитьТест("ЗаписьОбъектовРегистрНакопления")
			.ДобавитьТест("ЗаписьОбъектовРегистрБухгалтерии")
			.ДобавитьТест("ЗаписьОбъектовРегистрРасчета")
			.ДобавитьТест("ЗаписьОбъектовКонстанта")
	;
		
КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт
	
	РатСборДанныхСлужебный.ОстановитьСборДанных();
	
КонецПроцедуры

Процедура ИспользуетсяСборДанных_БезИнициализации() Экспорт
	
	ИспользуетсяСборДанных = РатСборДанныхСлужебный.ИспользуетсяСборДанных();
	ЮТест.ОжидаетЧто(ИспользуетсяСборДанных).ЭтоЛожь();
	
КонецПроцедуры

Процедура ИспользуетсяСборДанных_ПослеИнициализации() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	ИспользуетсяСборДанных = РатСборДанныхСлужебный.ИспользуетсяСборДанных();
	
	ЮТест.ОжидаетЧто(ИспользуетсяСборДанных)
		.ЭтоИстина();
	
КонецПроцедуры

Процедура ЗафиксироватьЗаписьОбъекта_До_Инициализации() Экспорт
	
	ЮТест.ОжидаетЧто(РатСборДанныхСлужебный)
		.Метод("ЗафиксироватьЗаписьОбъекта").Параметр("")
		.ВыбрасываетИсключение("Использование функциональности сбора данных до инициализации");
	
КонецПроцедуры

Процедура ЗаписьОбъектовСправочник() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	
	ПроверкаЗаписиОбъекта(Ссылка, "СправочникОбъект.Ф_Номенклатура");
	
КонецПроцедуры

Процедура ЗаписьОбъектовДокумент() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьДокумент(Документы.Ф_Чек);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ДокументОбъект.Ф_Чек");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланВидовХарактеристик() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыВидовХарактеристик.Ф_ПВХ);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланВидовХарактеристикОбъект.Ф_ПВХ");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланСчетов() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыСчетов.Ф_ПланСчетов);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланСчетовОбъект.Ф_ПланСчетов");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланВидовРасчета() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыВидовРасчета.Ф_ПланВидовРасчета);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланВидовРасчетаОбъект.Ф_ПланВидовРасчета");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланОбмена() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыОбмена.Ф_Все);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланОбменаОбъект.Ф_Все");
	
КонецПроцедуры

Процедура ЗаписьОбъектовБизнесПроцесс() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(БизнесПроцессы.Ф_БизнесПроцесс);
	
	ПроверкаЗаписиОбъекта(Ссылка, "БизнесПроцессОбъект.Ф_БизнесПроцесс");
	
КонецПроцедуры

Процедура ЗаписьОбъектовЗадача() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Задачи.Ф_Задача);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ЗадачаОбъект.Ф_Задача");
	
КонецПроцедуры

Процедура ЗаписьОбъектовРегистрСведений() Экспорт
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	ЮТест.Данные().КонструкторОбъекта(РегистрыСведений.Ф_ПериодическаяКонстанта)
		.ФикцияОбязательныхПолей()
		.Записать();
	
	ПроверкаЗаписиНабораЗаписей("РегистрСведенийНаборЗаписей.Ф_ПериодическаяКонстанта");
	
КонецПроцедуры

Процедура ЗаписьОбъектовРегистрНакопления() Экспорт
	
	Регистратор = ЮТест.Данные().СоздатьДокумент(Документы.Ф_Чек);
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	ЮТест.Данные().КонструкторДвижений(Регистратор, "Ф_ОстаткиТоваров")
		.ДобавитьСтроку()
		.ФикцияОбязательныхПолей()
		.Записать();
	
	ПроверкаЗаписиНабораЗаписей("РегистрНакопленияНаборЗаписей.Ф_ОстаткиТоваров");
	
КонецПроцедуры

Процедура ЗаписьОбъектовРегистрБухгалтерии() Экспорт
	
	Регистратор = ЮТест.Данные().СоздатьДокумент(Документы.Ф_ТестированиеМонитораИзменений);
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	ЮТест.Данные().КонструкторДвижений(Регистратор, "Ф_РегистрБухгалтерии")
		.ДобавитьСтроку()
		.ФикцияОбязательныхПолей()
		.Записать();
	
	ПроверкаЗаписиНабораЗаписей("РегистрБухгалтерииНаборЗаписей.Ф_РегистрБухгалтерии");
	
КонецПроцедуры

Процедура ЗаписьОбъектовРегистрРасчета() Экспорт
	
	Регистратор = ЮТест.Данные().СоздатьДокумент(Документы.Ф_ТестированиеМонитораИзменений);
	
	РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
	ЮТест.Данные().КонструкторДвижений(Регистратор, "Ф_РегистрРасчета")
		.ДобавитьСтроку()
		.ФикцияОбязательныхПолей()
		.Записать();
	
	ПроверкаЗаписиНабораЗаписей("РегистрРасчетаНаборЗаписей.Ф_РегистрРасчета");
	
КонецПроцедуры

Процедура ЗаписьОбъектовКонстанта() Экспорт

	РатСборДанныхСлужебный.ИнициализироватьСборДанных();

	Константы.Ф_Константа.Установить(ЮТест.Данные().СлучайнаяСтрока(10));

	ПроверкаЗаписиКонстанты();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗаписиОбъекта(Ссылка, ИмяТипа)
	
	Результат = РатСборДанныхСлужебный.ОстановитьСборДанныхИПолучитьЗаписи();
	
	ЮТест.ОжидаетЧто(Результат)
		.Заполнено()
		.Свойство("Записи").Заполнено()
		.Свойство("ДанныеВерсий").Заполнено()
	.Что(Результат.Записи)
		.ИмеетДлину(1)
		.Элемент("[0].Тип").Равно(Тип(ИмяТипа))
	.Что(Результат.ДанныеВерсий)
		.ИмеетДлину(1);
	;
	
КонецПроцедуры

Процедура ПроверкаЗаписиНабораЗаписей(ИмяТипа)

	Результат = РатСборДанныхСлужебный.ОстановитьСборДанныхИПолучитьЗаписи();
	
	ЮТест.ОжидаетЧто(Результат)
		.Заполнено()
		.Свойство("Записи").Заполнено()
		.Свойство("ДанныеВерсий").Заполнено()
	.Что(Результат.Записи)
		.ИмеетДлинуБольше(0)
		.Элемент("[-1].Тип").Равно(Тип(ИмяТипа))
	;

КонецПроцедуры

Процедура ПроверкаЗаписиКонстанты()

	Результат = РатСборДанныхСлужебный.ОстановитьСборДанныхИПолучитьЗаписи();

	ЮТест.ОжидаетЧто(Результат)
		.Заполнено()
		.Свойство("Записи").Заполнено()
		.Свойство("ДанныеВерсий").Заполнено()
	.Что(Результат.Записи)
		.ИмеетДлину(1)
		.Элемент("[0].Ключ").Равно("Константа.Ф_Константа")
	.Что(Результат.ДанныеВерсий)
		.ИмеетДлинуБольше(0);
	;
	
КонецПроцедуры

#КонецОбласти
