//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Проверяет, используется ли в системе сбор данных.
//
// Возвращаемое значение:
//   Булево - Истина, если сбор данных используется, иначе Ложь.
Функция ИспользуетсяСборДанных() Экспорт
	
	Возврат РатСборДанныхСлужебный.ИспользуетсяСборДанных();
	
КонецФункции

// Инициализирует сбор данных, создавая временное хранилище для контекста и сохраняя его адрес в параметрах сеанса.
//
// Возвращаемое значение:
//   Строка - адрес временного хранилища
Функция ИнициализироватьСборДанных() Экспорт
	
	Возврат РатСборДанныхСлужебный.ИнициализироватьСборДанных();
	
КонецФункции

// Останавливает сбор данных, очищая адрес временного контекста в параметрах сеанса.
Процедура ОстановитьСборДанных() Экспорт
	
	РатСборДанныхСлужебный.ОстановитьСборДанных();
	
КонецПроцедуры

// Останавливает сбор данных и возвращает накопленные записи.
//
// Возвращаемое значение:
//   Массив из см. НовоеОписаниеЗаписи - Массив записей, собранных во время сбора данных
Функция ОстановитьСборДанныхИПолучитьЗаписи() Экспорт
	
	Возврат РатСборДанныхСлужебный.ОстановитьСборДанныхИПолучитьЗаписи();
	
КонецФункции

// Создает и возвращает структуру для описания записи с базовыми полями.
//
// Возвращаемое значение:
//   Структура - структура с полями "Данные", "Стек" и "Время" для сбора информации.
Функция НовоеОписаниеЗаписи() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Тип");
	Описание.Вставить("Представление");
	Описание.Вставить("Ключ");
	Описание.Вставить("ИндексВерсии", -1);
	Описание.Вставить("ИндексПрошлойВерсии", -1);
	Описание.Вставить("Стек");
	Описание.Вставить("Время");
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
