//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных()
		.ДобавитьТест("Поиск")
	;
	
КонецПроцедуры

Процедура Поиск() Экспорт
	
	Период = ТекущаяДата();
	ЮТест.Данные().КонструкторОбъекта("Справочники.ПУБ_ОбъектыМетаданных")
		.Установить("Наименование", "Пользователи")
		.Установить("Тип", ПредопределенноеЗначение("Перечисление.Ф_ТипыОбъектов.Справочник"))
		.Записать();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_ОбъектыМетаданных");
	Ссылка2 = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_ОбъектыМетаданных");
	
	ЮТест.Данные().КонструкторОбъекта("РегистрыСведений.ПУБ_КомментарииПоОбъекту")
		.Установить("Объект", Ссылка)
		.Установить("Период", Период)
		.ДобавитьЗапись()
		.Установить("Объект", Ссылка2)
		.ДобавитьЗапись();
	
	ПростойОтбор = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2         |
	|| --------------- | ------------ |
	|| Наименование    | Пользователи |
	|| Тип             | Справочник   |
	|| ПометкаУдаления | Ложь         |");
	ТипизированныйОтбор = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2         | Кол3                 |
	|| --------------- | ------------ | -------------------- |
	|| Наименование    | Пользователи | string               |
	|| Тип             | Справочник   | EnumRef.Ф_ТипыОбъектов |
	|| ПометкаУдаления | Ложь         | boolean              |");
	УсловиеВСписке = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2                 | Кол3    |
	|| --------------- | -------------------- | ------- |
	|| Реквизит        | Значение             | Условие |
	|| Наименование    | Пользователи         |         |
	|| Тип             | Справочник; Документ | ВСписке |
	|| ПометкаУдаления | Ложь                 | Равно   |");
	УсловиеВПустомСписке = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2         | Кол3    |
	|| --------------- | ------------ | ------- |
	|| Реквизит        | Значение     | Условие |
	|| Наименование    | Пользователи |         |
	|| Тип             |              | ВСписке |
	|| ПометкаУдаления | Ложь         | Равно   |");
	УсловиеТипизированномВСписке = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2                     | Кол3    | Кол4                 |
	|| --------------- | ------------------------ | ------- | -------------------- |
	|| Реквизит        | Значение                 | Условие | Тип                  |
	|| Наименование    | Пользователи             |         |                      |
	|| Тип             | Справочник; Перечисление | ВСписке | EnumRef.Ф_ТипыОбъектов |
	|| ПометкаУдаления | Ложь                     | Равно   |                      |");
	
	УсловиеПоСоставномуРеквизиту = ЮТест.Данные().ТаблицаMarkDown(СтрШаблон(
	"| Кол1     | Кол2     | Кол3           | Кол4                         |
	|| -------- | -------- | -------------- | ---------------------------- |
	|| Реквизит | Значение | Условие        | Тип                          |
	|| Объект   | %1;%2    | ВСписке        | CatalogRef.Ф_ОбъектыМетаданных |
	|| Период   | %3       | БольшеИлиРавно |                              |",
	Ссылка, Ссылка2, Формат(Период, "ДФ=yyyy-MM-ddTHH:mm:ss;")));
	
	Варианты = ЮТест.Варианты("Описание, Адрес, Условия, Количество")
		.Добавить("Простой отбор", "Справочник/ПУБ_ОбъектыМетаданных", ПростойОтбор, 1)
		.Добавить("Типизированный отбор", "Справочник/ПУБ_ОбъектыМетаданных", ТипизированныйОтбор, 1)
		.Добавить("Отбор в списке", "Справочник/ПУБ_ОбъектыМетаданных", УсловиеВСписке, 1)
		.Добавить("Отбор в пустом списке", "Справочник/ПУБ_ОбъектыМетаданных", УсловиеВПустомСписке, 0)
		.Добавить("Отбор в типизированном списке", "Справочник/ПУБ_ОбъектыМетаданных", УсловиеТипизированномВСписке, 1)
		.Добавить("Отбор по составному реквизиту", "РегистрСведений/ПУБ_КомментарииПоОбъекту", УсловиеПоСоставномуРеквизиту, 2)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
	
		Тело = РатШагиВанессыКлиент.СтруктураПоиска(Вариант.Условия);
		Ответ = ПомощникТестированияРат.ЗапросAPI(Вариант.Адрес, "GET", Тело);
		
		ЮТест.ОжидаетЧто(Ответ, Вариант.Описание + Ответ.Тело)
			.Свойство("КодСостояния").Равно(200)
			.Свойство("Данные").ИмеетТип("Массив").ИмеетДлину(Вариант.Количество);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
