//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// См. РатПреобразования.ИмяСистемногоПеречисления
Функция ИмяСистемногоПеречисления(Тип) Экспорт
	
	ИмяПеречисления = Строка(Тип);
	Если СтрНачинаетсяС(ИмяПеречисления, "Перечисление") Тогда
		Возврат Сред(ИмяПеречисления, СтрДлина("Перечисление") + 1);
	Иначе
		Возврат ИмяПеречисления;
	КонецЕсли;
	
КонецФункции

// См. РатПреобразования.МенеджерСистемногоПеречисления
Функция МенеджерСистемногоПеречисления(ИмяПеречисления) Экспорт
	
	Если РатТипыДанных.ЭтоСтрока(ИмяПеречисления) Тогда
		Возврат РатАлгоритмы.ВычислитьВыражение(ИмяПеречисления);
	Иначе
		Возврат ИмяПеречисления;
	КонецЕсли;
	
КонецФункции

// См. РатПреобразования.КлючСистемногоПеречисления
Функция КлючСистемногоПеречисления(ЗначениеПеречисления) Экспорт
	
	ИмяПеречисления = ИмяСистемногоПеречисления(ТипЗнч(ЗначениеПеречисления));
	
	Возврат РатПовтИсп.КлючСистемногоПеречисления(ИмяПеречисления, Строка(ЗначениеПеречисления));
	
КонецФункции

// См. РатПреобразования.КлючиСистемногоПеречисления
Функция КлючиСистемногоПеречисления(МенеджерПеречисления) Экспорт
	
	Если РатТипыДанных.ЭтоСтрока(МенеджерПеречисления) Тогда
		Возврат РатПовтИсп.КлючиСистемногоПеречисления(МенеджерПеречисления);
	Иначе
		ИмяПеречисления = ИмяСистемногоПеречисления(МенеджерПеречисления);
		Возврат РатПовтИсп.КлючиСистемногоПеречисления(ИмяПеречисления);
	КонецЕсли;
	
КонецФункции

// См. РатПреобразования.ЗначениеСистемногоПеречисления
Функция ЗначениеСистемногоПеречисления(ОжидаемыйТип, Значение, СтатусОбработкиЗапроса) Экспорт
	
	ИмяПеречисления = ИмяСистемногоПеречисления(ОжидаемыйТип);
	Менеджер = МенеджерСистемногоПеречисления(ИмяПеречисления);
	
	Попытка
		Возврат Менеджер[Значение];
	Исключение
		// Ключ может не быть идентификатором элемента перечисления
	КонецПопытки;
	
	// Ищем значение по строковому представлению или идентификатору, полученному из представления
	Для Каждого Элемент Из Менеджер Цикл
		
		Если Строка(Элемент) = Значение Тогда
			Возврат Элемент;
		КонецЕсли;
		
		Если РатСтроки.ПреобразоватьВИдентификатор(Строка(Элемент)) = Значение Тогда
			Возврат Элемент;
		КонецЕсли;
		
	КонецЦикла;

	ТекстОшибки = СтрШаблон("Не удалось найти значение системного перечисления '%1' (%2)", Значение, ОжидаемыйТип);
	ТекстОшибки = РатОбщийКлиентСервер.ТекстОшибки(ИнформацияОбОшибке(), ТекстОшибки);
	КлассОшибки = РатОбщий.КлассыОшибок().Десериализация;
	РатОбщий.ЗафиксироватьОшибку(СтатусОбработкиЗапроса, КлассОшибки, ТекстОшибки);
	Возврат Неопределено;
		
КонецФункции

#КонецОбласти
