//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ИнформацияОбИзмененияхОбъекта")
		.ДобавитьТест("СписокИзменений")
		.ДобавитьТест("ЗарегистрироватьИзменения")
		.ДобавитьТест("УдалитьРегистрациюИзменений_Все")
		.ДобавитьТест("УдалитьРегистрациюИзменений_ПоОбъектуМетаданных")
		.ДобавитьТест("УдалитьРегистрациюИзменений_ПоОбъекту")
	;
	
КонецПроцедуры

Процедура СписокИзменений() Экспорт
	
	Данные = Данные(1, 2, 3);
	АдресИзмененийУзла = АдресИзмененийУзла(Данные.Узел);
	
	Результат = Неопределено;
	Статус = ВызватьОбработчик("GET", АдресИзмененийУзла, Неопределено, Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	ЮТест.ОжидаетЧто(Результат, "Сводная информация")
		.Заполнено()
		.Содержит(ЮТест.Предикат()
			.Реквизит("МетаПолноеИмя").Равно("Справочник.Ф_Номенклатура")
			.Реквизит("КоличествоИзменений").Равно(5)
			.Реквизит("КоличествоВыгруженных").Равно(3)
			.Реквизит("КоличествоНеВыгруженных").Равно(2)
		);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменения() Экспорт
	
	Данные = Данные(3, 0 , 0);
	АдресИзмененийУзла = АдресИзмененийУзла(Данные.Узел);
	Тело = Новый Массив();
	Тело.Добавить("Справочник.Ф_Номенклатура." + Данные.Незарегистрированные[0]);
	Тело.Добавить("Справочник.Ф_Номенклатура." + Данные.Незарегистрированные[1]);
	
	Результат = Неопределено;
	Статус = ВызватьОбработчик("PUT", АдресИзмененийУзла, Тело, Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("message").Равно("Объекты успешно зарегистрированы на узле обмена");
	
	ЗарегистрированныеОбъекты = ЗарегистрированныеОбъекты(Данные.Узел);
	
	ЮТест.ОжидаетЧто(ЗарегистрированныеОбъекты, "Зарегистрированные объекты")
		.Содержит(Данные.Незарегистрированные[0])
		.Содержит(Данные.Незарегистрированные[1])
		.НеСодержит(Данные.Незарегистрированные[2])
		.ИмеетДлину(2);
	
КонецПроцедуры

Процедура УдалитьРегистрациюИзменений_Все() Экспорт
	
	Узел = УзелОбмена();
	ЗарегистрироватьНаУзле(Узел, Справочники.Ф_Номенклатура, 2);
	ЗарегистрироватьНаУзле(Узел, Документы.Ф_Чек, 2);
	
	АдресИзмененийУзла = АдресИзмененийУзла(Узел);
	
	Результат = Неопределено;
	Статус = ВызватьОбработчик("DELETE", АдресИзмененийУзла, "ALL", Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("message").Равно("Объекты успешно сняты с регистрации на узле обмена");
	
	ЗарегистрированныеОбъекты = ЗарегистрированныеОбъекты(Узел);
	
	ЮТест.ОжидаетЧто(ЗарегистрированныеОбъекты, "Зарегистрированные объекты")
		.НеЗаполнено();
	
КонецПроцедуры

Процедура УдалитьРегистрациюИзменений_ПоОбъектуМетаданных() Экспорт
	
	Узел = УзелОбмена();
	ЗарегистрироватьНаУзле(Узел, Справочники.Ф_Номенклатура, 2);
	ЗарегистрироватьНаУзле(Узел, Документы.Ф_Чек, 2);
	
	АдресИзмененийУзла = АдресИзмененийУзла(Узел);
	
	Результат = Неопределено;
	Статус = ВызватьОбработчик("DELETE", АдресИзмененийУзла, "Документы.Ф_Чек", Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("message").Равно("Объекты успешно сняты с регистрации на узле обмена");
	
	ЗарегистрированныеОбъекты = ЗарегистрированныеОбъекты(Узел);
	
	ЮТест.ОжидаетЧто(ЗарегистрированныеОбъекты, "Зарегистрированные объекты")
		.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат().ИмеетТип("СправочникСсылка.Ф_Номенклатура"));
	
	Результат = Неопределено;
	Статус = ВызватьОбработчик("DELETE", АдресИзмененийУзла, "Справочник.Ф_Номенклатура", Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("message").Равно("Объекты успешно сняты с регистрации на узле обмена");
	
	ЗарегистрированныеОбъекты = ЗарегистрированныеОбъекты(Узел);
	
	ЮТест.ОжидаетЧто(ЗарегистрированныеОбъекты, "Зарегистрированные объекты")
		.НеЗаполнено();
	
КонецПроцедуры

Процедура УдалитьРегистрациюИзменений_ПоОбъекту() Экспорт
	
	Данные = Данные(0, 2 , 2);
	АдресИзмененийУзла = АдресИзмененийУзла(Данные.Узел);
	
	Тело = Новый Массив();
	Тело.Добавить("Справочник.Ф_Номенклатура." + Данные.Зарегистрированные[0]);
	Тело.Добавить("Справочник.Ф_Номенклатура." + Данные.Отправленные[1]);
	
	Результат = Неопределено;
	Статус = ВызватьОбработчик("DELETE", АдресИзмененийУзла, Тело, Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("message").Равно("Объекты успешно сняты с регистрации на узле обмена");
	
	ЗарегистрированныеОбъекты = ЗарегистрированныеОбъекты(Данные.Узел);
	
	ЮТест.ОжидаетЧто(ЗарегистрированныеОбъекты, "Зарегистрированные объекты")
		.Содержит(Данные.Зарегистрированные[1])
		.Содержит(Данные.Отправленные[0])
		.НеСодержит(Данные.Зарегистрированные[0])
		.НеСодержит(Данные.Отправленные[1])
		.ИмеетДлину(2);
	
КонецПроцедуры

Процедура ИнформацияОбИзмененияхОбъекта() Экспорт
	
	Данные = Данные(1, 1, 1);
	АдресИзмененийУзла = АдресИзмененийУзла(Данные.Узел);
	
	Варианты = ЮТест.Варианты("Объект, Статус, Описание")
		.Добавить(Данные.Незарегистрированные[0], "Незарегистрирован", "Незарегистрированный объект")
		.Добавить(Данные.Зарегистрированные[0], "Зарегистрирован", "Зарегистрированный объект")
		.Добавить(Данные.Отправленные[0], "Отправлен", "Отправленный объект")
		.СписокВариантов();
	
	Для Каждого Вариант Из Варианты Цикл
		
		Адрес = АдресИзмененийУзла + "/Справочник.Ф_Номенклатура." + Вариант.Объект.Код;
		
		Результат = Неопределено;
		Статус = ВызватьОбработчик("GET", Адрес, Неопределено, Результат);
		ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Вариант.Описание);
		ЮТест.ОжидаетЧто(Результат, Вариант.Описание)
			.Заполнено()
			.Свойство("Статус").Равно(Вариант.Статус);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УзелОбмена()
	
	Возврат ЮТест.Данные().КонструкторОбъекта(ПланыОбмена.Ф_Все)
		.ФикцияОбязательныхПолей()
		.Записать();
	
КонецФункции

Функция АдресИзмененийУзла(Узел)
	
	Возврат СтрШаблон("ПланОбмена/Ф_Все/%1/Изменения", Узел);
	
КонецФункции

Функция Данные(Незарегистрированные = 1, Зарегистрированные = 2, Отправленные = 3)
	
	Данные = Новый Структура("Узел, Незарегистрированные, Зарегистрированные, Отправленные");
	Данные.Узел = УзелОбмена();
	НомерСообщения = 5;
	
	Данные.Незарегистрированные = Новый Массив();
	Данные.Зарегистрированные = Новый Массив();
	Данные.Отправленные = Новый Массив();
	
	Менеджер = Справочники.Ф_Номенклатура;
	
	Для Инд = 1 По Незарегистрированные Цикл
		Ссылка = ЮТест.Данные().КонструкторОбъекта(Менеджер)
			.ФикцияОбязательныхПолей()
			.Записать();
		
		Данные.Незарегистрированные.Добавить(Ссылка);
	КонецЦикла;
	
	Данные.Зарегистрированные = ЗарегистрироватьНаУзле(Данные.Узел, Менеджер, Зарегистрированные);
	
	Для Инд = 1 По Отправленные Цикл
		Ссылка = ЮТест.Данные().КонструкторОбъекта(Менеджер)
			.ФикцияОбязательныхПолей()
			.Записать();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Данные.Узел, Ссылка);
		ПланыОбмена.ВыбратьИзменения(Данные.Узел, НомерСообщения, Ссылка);
		Данные.Отправленные.Добавить(Ссылка);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ЗарегистрироватьНаУзле(Узел, Менеджер, Количествл)
	
	Объекты = Новый Массив();
	
	Для Инд = 1 По Количествл Цикл
		Объект = ЮТест.Данные().КонструкторОбъекта(Менеджер)
			.ФикцияОбязательныхПолей()
			.Записать();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Объект);
		Объекты.Добавить(Объект);
	КонецЦикла;
	
	Возврат Объекты;
	
КонецФункции

Функция ЗарегистрированныеОбъекты(Узел) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Ф_Номенклатура.Изменения
	|ГДЕ
	|	Узел = &Узел";
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

Функция ВызватьОбработчик(Метод, Адрес, Тело, Результат = Неопределено)
	
	Статус = ПомощникТестированияРат.Статус();
	Шаблон = РатШаблоныАдресов.ОпределитьШаблон(Метод, Адрес, Статус);
	ПараметрыЗапроса = ПараметрыЗапроса(Адрес, Тело, Статус);
	
	Результат = Неопределено;
	ОбработчикВыполнен = Ложь;
	
	Результат = РатОбмены.ВызватьОбработчик(Шаблон.Обработчик, ПараметрыЗапроса, Статус, ОбработчикВыполнен);
	
	Если НЕ ОбработчикВыполнен Тогда
		ВызватьИсключение "Обработчик не выполнен";
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

Функция ПараметрыЗапроса(Адрес, Тело, СтатусОбработкиЗапроса)
	
	ЧастиИмениТаблицы = СтрРазделить(Адрес, "/");
	ПараметрыЗапроса = Новый Структура("ТипМетаданных, ВидМетаданных, ИмяТаблицы, ИдентификаторУзла, Тело");
	ПараметрыЗапроса.ТипМетаданных = ЧастиИмениТаблицы[0];
	ПараметрыЗапроса.ВидМетаданных = ЧастиИмениТаблицы[1];
	ПараметрыЗапроса.ИдентификаторУзла = ЧастиИмениТаблицы[2];
	
	ПараметрыЗапроса.Тело = Тело;
	
	Если ЧастиИмениТаблицы.Количество() > 4 Тогда
		ПараметрыЗапроса.Вставить("ИдентификаторОбъекта", ЧастиИмениТаблицы[4]);
	КонецЕсли;
	
	МетаданныеЗапроса = РатСервис.МетаданныеЗапроса(ПараметрыЗапроса, СтатусОбработкиЗапроса);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, "Получение описания метаданных из запроса");
	РатКоллекции.ОбъединитьВСтруктуру(ПараметрыЗапроса, МетаданныеЗапроса);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

#КонецОбласти
