//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДобавитьКомментарийПроведения();
	
	НаборКомментариев = РегистрыСведений.Ф_КомментарииПоОбъекту.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаОбъекта Из Объекты Цикл
		
		Объект = СтрокаОбъекта.ИзменяемыйОбъект.ПолучитьОбъект();
		
		ЗаписьКомментария = НаборКомментариев.Добавить();
		ЗаписьКомментария.Объект = СтрокаОбъекта.ИзменяемыйОбъект;
		ЗаписьКомментария.Комментарий = СтрШаблон("Изменение '%1': '%2' -> '%3'", СтрокаОбъекта.ИмяРеквизита, Объект[СтрокаОбъекта.ИмяРеквизита], СтрокаОбъекта.НовоеЗначение);
		ЗаписьКомментария.Период = Дата;
		
		Объект[СтрокаОбъекта.ИмяРеквизита] = СтрокаОбъекта.НовоеЗначение;
		Объект.Записать();
		
	КонецЦикла;
	
	НаборКомментариев.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКомментарийПроведения()
	
	ЗаписьКомментария = РегистрыСведений.Ф_КомментарииПоОбъекту.СоздатьМенеджерЗаписи();
	ЗаписьКомментария.Объект = Ссылка;
	ЗаписьКомментария.Комментарий = "Проведение объекта";
	ЗаписьКомментария.Период = Дата;
	ЗаписьКомментария.Записать();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
