//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ДанныеПользователя")
	;
	
КонецПроцедуры

Процедура ПередТестом() Экспорт
	
	ЮТест.Контекст().УстановитьЗначение("СозданныеПользователи", Новый Массив());
	
КонецПроцедуры

Процедура ПослеТеста() Экспорт
	
	СозданныеПользователи = ЮТест.Контекст().Значение("СозданныеПользователи");
	
	Для Каждого ИмяПользователя Из СозданныеПользователи Цикл
		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
		Если Пользователь <> Неопределено Тогда
			Пользователь.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДанныеПользователя() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = ЮТест.Данные().СлучайнаяСтрока();
	Пользователь.Пароль = ЮТест.Данные().СлучайнаяСтрока();
	Пользователь.Роли.Добавить(Метаданные.Роли.Ф_Администратор);
	Пользователь.Записать();
	Результат = Неопределено;
	
	ИмяПользователя = Пользователь.Имя;
	ПараметрыЗапроса = Новый Структура("Наименование", ИмяПользователя);
	
	Статус = ВызватьОбработчик("ДанныеПользователя", ПараметрыЗапроса, Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Текущий пользователь");
	
	ЮТест.ОжидаетЧто(Результат, "Данные пользователя")
		.Свойство("Имя").Равно(ИмяПользователя)
		.Свойство("УникальныйИдентификатор")
		.Свойство("ПарольУстановлен")
		.Свойство("Роли")
		.НетСвойства("Пароль")
		.НетСвойства("СохраняемоеЗначениеПароля");
	
	КлассыОшибок = РатОбщий.КлассыОшибок();
	
	ПараметрыЗапроса = Новый Структура("Наименование", ИмяПользователя + Новый УникальныйИдентификатор());
	Статус = ВызватьОбработчик("ДанныеПользователя", ПараметрыЗапроса);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, "Отсутствующий пользователь", КлассыОшибок.НеНайденаЗаписьИБ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызватьОбработчик(Обработчик, ПараметрыЗапроса, Результат = Неопределено)
	
	Результат = Неопределено;
	Статус = ПомощникТестированияРат.Статус();
	ОбработчикВыполнен = Ложь;
	
	Результат = РатПользователиИнформационнойБазы.ВызватьОбработчик(Обработчик, ПараметрыЗапроса, Статус, ОбработчикВыполнен);
	
	Если НЕ ОбработчикВыполнен Тогда
		ВызватьИсключение "Обработчик не выполнен";
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти
