//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапросБезПараметров")
			.СПараметрами("Результат = 2 + 2;")
			.СПараметрами("Сообщить(1);")
			.СПараметрами("Справочники.ПУБ_Номенклатура.СоздатьЭлемент().Наименование = ""Тест""")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_ВыводСообщений")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_ОтключениеБезопасногоРежима")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Примитивы")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Массив")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_ТипизированнаяПеременная")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_МассивТипизированныхПеременных")
	;
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапросБезПараметров(Алгоритм) Экспорт
	
	Данные = ВыполнитьПроизвольныйАлгоритм(Алгоритм);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина);
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_ВыводСообщений() Экспорт
	
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(1+1);");
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages")
			.ИмеетТип("Массив")
			.ИмеетДлину(1)
			.Содержит("2");
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_ОтключениеБезопасногоРежима() Экспорт

	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(?(БезопасныйРежим(), ""safe"", ""unsafe""));", Неопределено, Ложь);

	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно("unsafe");

КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Примитивы() Экспорт
	
	Параметры = Новый Структура("Параметр1, Параметр2, Параметр3", "1", 2);
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(Параметры.Параметр1 + Параметры.Параметр2);", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно("12");
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Массив() Экспорт
	
	Параметры = Новый Структура("Параметр1, Параметр2", "1", СтрРазделить("2,3,4", ","));
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(Параметры.Параметр1 + СтрСоединить(Параметры.Параметр2, """"));", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно("1234");
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_ТипизированнаяПеременная() Экспорт
	
	Наименование = "Тест ссылки";
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Номенклатура, Наименование);
	Параметры = Новый Структура("Ссылка", РатПреобразования.СериализоватьЗначение(Ссылка));
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(Параметры.Ссылка);", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно(Наименование);
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_МассивТипизированныхПеременных() Экспорт
	
	Наименование = "Тест ссылки";
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Номенклатура, Наименование);
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(РатПреобразования.СериализоватьЗначение(Ссылка));
	Ссылки.Добавить(РатПреобразования.СериализоватьЗначение(Ссылка));
	
	Параметры = Новый Структура("Ссылки", Ссылки);
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(СтрСоединить(Параметры.Ссылки, ""+""));", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно(Наименование + "+" + Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьПроизвольныйАлгоритм(Алгоритм, Параметры = Неопределено, БезопасныйРежим = Истина)
	
	Тело = Новый Структура("Алгоритм, Параметры, БезопасныйРежим", Алгоритм, Параметры, БезопасныйРежим);
	Запрос = ПомощникТестированияРат.НовыйЗапрос("ВыполнитьАлгоритм", "POST");
	Запрос.УстановитьТелоКакСтрокуJSON(Тело);
	
	Ответ = РатСервис.ЗапросAPI(Запрос);
	ПомощникТестированияРат.ПроверитьОтвет(Ответ, "Проверка успешности ответа");
	
	Возврат ПомощникТестированияРат.ОбъектИзСтроки(Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

#КонецОбласти
