//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает таблицу описания типов метаданных, используемых при работе расширения.
//
// Возвращаемое значение:
//   см. РатМетаданные.ТипыМетаданных
//
// Пример:
//   ТипыМетаданных = РатПовтИсп.ТипыМетаданных();
//
Функция ТипыМетаданных() Экспорт
	
	Возврат РатМетаданные.ТипыМетаданных();
	
КонецФункции

// Возвращает структуру данных по имени таблицы информационной базы.
//
// Параметры:
//   ИмяТаблицы - Строка - Имя таблицы информационной базы (напр. Справочник.Пользователи)
//
// Возвращаемое значение:
//   см. РатМетаданные.СтруктураТаблицы
//
// Пример:
//   Структура = РатПовтИсп.СтруктураТаблицы("Справочник.Пользователи");
//
Функция СтруктураТаблицы(ИмяТаблицы) Экспорт
	
	Возврат РатМетаданные.СтруктураТаблицы(ИмяТаблицы);
	
КонецФункции

// Возвращает описание типа реквизита по полному имени.
// Используется для определения типа значения отбора.
//
// Параметры:
//   Путь - Строка - Полный путь к реквизиту, [ТипМетаданных].[ВидМетаданных].[ИмяРеквизита]{.ИмяРеквизитаСсылки}
//
// Возвращаемое значение:
//   ОписаниеТипов - Тип указанного реквизита
//
// Пример:
//   Тип = РатПовтИсп.ТипРеквизита("Справочник.Пользователи.Код");
//
Функция ТипРеквизита(Путь) Экспорт

	Возврат РатМетаданные.ТипРеквизита(Путь);

КонецФункции

// Возвращает перечень используемых классов ошибок.
// Используется для группировки проблем.
// На основании класса определяется код возврата ответа.
//
// Возвращаемое значение:
//   см. РатОбщий.КлассыОшибок
//
// Пример:
//   Классы = РатПовтИсп.КлассыОшибок();
//
Функция КлассыОшибок() Экспорт
	
	Возврат РатОбщий.КлассыОшибок(Ложь);
	
КонецФункции

// Возвращает имена значений системного перечисления в формате camel case.
//
// Параметры:
//   ИмяПеречисления - Строка - Имя системного перечисления
//
// Возвращаемое значение:
//   Массив из Строка - Имена значений системного перечисления в формате camel case
//
// Пример:
//   Ключи = РатПовтИсп.КлючиСистемногоПеречисления("СостояниеФоновогоЗадания");
//   // Результат: ["Активно", "Завершено", "ЗавершеноАварийно", "Отменено"]
//
Функция КлючиСистемногоПеречисления(ИмяПеречисления) Экспорт
	
	Ключи = Неопределено;
	
	Если ИмяПеречисления = "СостояниеФоновогоЗадания" Тогда
		Ключи = СтрРазделить("Активно,Завершено,ЗавершеноАварийно,Отменено", ",");
	ИначеЕсли ИмяПеречисления = "ВидСчета" Тогда
		Ключи = СтрРазделить("АктивноПассивный,Активный,Пассивный", ",");
	Иначе
		Менеджер = РатПреобразования.МенеджерСистемногоПеречисления(ИмяПеречисления);
		Ключи = Новый Массив;
		
		Для Каждого Значение Из Менеджер Цикл
			ПредставлениеЗначения = Строка(Значение);
			Идентификатор = РатСтроки.ПреобразоватьВИдентификатор(ПредставлениеЗначения);
			Ключи.Добавить(Идентификатор);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ключи;
	
КонецФункции

// Возвращает имя значения системного перечисления по представлению в формате camel case.
// Если идентификатор, полученный из представления, отсутствует в перечислении
// (напр. "НачалоВчерашнегоДня"), возвращается этот идентификатор.
//
// Параметры:
//   ИмяПеречисления - Строка - Имя системного перечисления
//   ПредставленияЗначения - Строка - Представления значения
//
// Возвращаемое значение:
//   Строка - Имя значения системного перечисления в формате camel case
//
// Пример:
//   Ключ = РатПовтИсп.КлючСистемногоПеречисления("СостояниеФоновогоЗадания", "Активно");
//   // Результат: "Активно"
//
Функция КлючСистемногоПеречисления(ИмяПеречисления, ПредставленияЗначения) Экспорт
	
	Менеджер = РатПреобразования.МенеджерСистемногоПеречисления(ИмяПеречисления);
	
	Ключи = РатПовтИсп.КлючиСистемногоПеречисления(ИмяПеречисления);
	
	Для Каждого Ключ Из Ключи Цикл

		Попытка
			ПредставлениеКлюча = Строка(Менеджер[Ключ]);
		Исключение
			// Ключ может не быть идентификатором элемента перечисления
			Продолжить;
		КонецПопытки;
		
		Если ПредставлениеКлюча = ПредставленияЗначения Тогда
			Возврат Ключ;
		КонецЕсли;
		
	КонецЦикла;
	
	// Идентификатор значения не является идентификатором элемента перечисления,
	// возвращаем идентификатор, полученный из представления значения
	Возврат РатСтроки.ПреобразоватьВИдентификатор(ПредставленияЗначения);
	
КонецФункции

// Возвращает значение ОписаниеТипов содержащее массив типов на все имеющиеся объекты ссылочного типа.
//
// Возвращаемое значение:
//   ОписаниеТипов - описание типов, содержащее весь набор типов пространства "http://v8.1c.ru/8.1/data/core"
//
// Пример:
//   ОписаниеТипов = РатПовтИсп.ПолучитьОписаниеТиповЛюбаяСсылка();
//
Функция ПолучитьОписаниеТиповЛюбаяСсылка() Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(
	"<TypeDescription xmlns=""http://v8.1c.ru/8.1/data/core"">
	|      <TypeSet xmlns:cc=""http://v8.1c.ru/8.1/data/enterprise/current-config"">cc:AnyRef</TypeSet>
	|</TypeDescription>");
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

// Проверяет, относится ли тип к ссылочным типам данных конфигурации.
//
// Параметры:
//   ПредставлениеТипа - Строка - Представление типа в формате XML
//
// Возвращаемое значение:
//   Булево - Истина, если тип является ссылочным
//
// Пример:
//   Если РатПовтИсп.ЭтоСсылочныйТип("СправочникСсылка.Пользователи") Тогда ...
//
Функция ЭтоСсылочныйТип(ПредставлениеТипа) Экспорт
	
	Результат = Ложь;
	
	Если СтрНайти(ПредставлениеТипа, "Ref.") Тогда
		
		Тип = РатТипыДанных.ТипПоПредставлению(ПредставлениеТипа);
		Результат = РатПовтИсп.ПолучитьОписаниеТиповЛюбаяСсылка().СодержитТип(Тип);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
