//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции, предназначенные для использования другими 
// объектами конфигурации или другими программами
///////////////////////////////////////////////////////////////////////////////// 
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ИспользуетсяСборДанных_БезИнициализации")
		.ДобавитьТест("ИспользуетсяСборДанных_ПослеИнициализации")
		.ДобавитьТест("ЗафиксироватьЗаписьОбъекта_До_Инициализации")
		.ДобавитьТестовыйНабор("РатСборДанных.ЗаписьОбъектов").ВТранзакции()
			.ДобавитьТест("ЗаписьОбъектовСправочник")
			.ДобавитьТест("ЗаписьОбъектовДокумент")
			.ДобавитьТест("ЗаписьОбъектовПланВидовХарактеристик")
			.ДобавитьТест("ЗаписьОбъектовПланСчетов")
			.ДобавитьТест("ЗаписьОбъектовПланВидовРасчета")
			.ДобавитьТест("ЗаписьОбъектовПланОбмена")
			.ДобавитьТест("ЗаписьОбъектовБизнесПроцесс")
			.ДобавитьТест("ЗаписьОбъектовЗадача")
			.ДобавитьТест("ЗаписьОбъектовРегистрСведений")
			.ДобавитьТест("ЗаписьОбъектовРегистрНакопления")
			.ДобавитьТест("ЗаписьОбъектовРегистрБухгалтерии")
			.ДобавитьТест("ЗаписьОбъектовРегистрРасчета")
			.ДобавитьТест("ЗаписьОбъектовКонстанта")
	;
		
КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт
	
	РатСборДанных.ОстановитьСборДанных();
	
КонецПроцедуры

Процедура ИспользуетсяСборДанных_БезИнициализации() Экспорт
	
	ИспользуетсяСборДанных = РатСборДанных.ИспользуетсяСборДанных();
	ЮТест.ОжидаетЧто(ИспользуетсяСборДанных).ЭтоЛожь();
	
КонецПроцедуры

Процедура ИспользуетсяСборДанных_ПослеИнициализации() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	ИспользуетсяСборДанных = РатСборДанных.ИспользуетсяСборДанных();
	
	ЮТест.ОжидаетЧто(ИспользуетсяСборДанных)
		.ЭтоИстина();
	
КонецПроцедуры

Процедура ЗафиксироватьЗаписьОбъекта_До_Инициализации() Экспорт
	
	ЮТест.ОжидаетЧто(РатСборДанных)
		.Метод("ЗафиксироватьЗаписьОбъекта").Параметр("")
		.ВыбрасываетИсключение("до инициализации сбора данных");
	
КонецПроцедуры

Процедура ЗаписьОбъектовСправочник() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Номенклатура);
	
	ПроверкаЗаписиОбъекта(Ссылка, "СправочникОбъект.Ф_Номенклатура");
	
КонецПроцедуры

Процедура ЗаписьОбъектовДокумент() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьДокумент(Документы.ПУБ_Чек);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ДокументОбъект.ПУБ_Чек");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланВидовХарактеристик() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыВидовХарактеристик.ПУБ_ПВХ);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланВидовХарактеристикОбъект.Ф_ПВХ");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланСчетов() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыСчетов.ПУБ_ПланСчетов);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланСчетовОбъект.Ф_ПланСчетов");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланВидовРасчета() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыВидовРасчета.ПУБ_ПланВидовРасчета);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланВидовРасчетаОбъект.Ф_ПланВидовРасчета");
	
КонецПроцедуры

Процедура ЗаписьОбъектовПланОбмена() Экспорт
	
	РатСборДанных.ИнициализироватьСборДанных();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(ПланыОбмена.ПУБ_Все);
	
	ПроверкаЗаписиОбъекта(Ссылка, "ПланОбменаОбъект.ПУБ_Все");
	
КонецПроцедуры

Процедура ЗаписьОбъектовБизнесПроцесс() Экспорт

КонецПроцедуры

Процедура ЗаписьОбъектовЗадача() Экспорт

КонецПроцедуры

Процедура ЗаписьОбъектовРегистрСведений() Экспорт

КонецПроцедуры

Процедура ЗаписьОбъектовРегистрНакопления() Экспорт

КонецПроцедуры

Процедура ЗаписьОбъектовРегистрБухгалтерии() Экспорт

КонецПроцедуры

Процедура ЗаписьОбъектовРегистрРасчета() Экспорт

КонецПроцедуры

Процедура ЗаписьОбъектовКонстанта() Экспорт

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗаписиОбъекта(Ссылка, Тип)
	
	Записи = РатСборДанных.ОстановитьСборДанныхИПолучитьЗаписи();
	
	ЮТест.ОжидаетЧто(Записи)
		.ИмеетДлину(1)
		.Элемент("[0].Данные")
			.ИмеетТип(Тип)
			.Свойство("[0].Данные.Ссылка").Равно(Ссылка)
	;
КонецПроцедуры

#КонецОбласти
