//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ТипПоПредставлению")
			.СПараметрами("CatalogRef.Ф_Номенклатура", Тип("СправочникСсылка.Ф_Номенклатура"))
			.СПараметрами("EnumRef.Ф_ВидыОпераций", Тип("ПеречислениеСсылка.Ф_ВидыОпераций"))
			.СПараметрами("string", Тип("Строка"))
			.СПараметрами("decimal", Тип("Число"))
			.СПараметрами("dateTime", Тип("Дата"))
			.СПараметрами("boolean", Тип("Булево"))
		.ДобавитьТест("ЭтоСсылочныйТип")
			.СПараметрами("СправочникСсылка.Ф_Номенклатура", Истина)
			.СПараметрами("СправочникОбъект.Ф_Номенклатура", Ложь)
			.СПараметрами("ПеречислениеСсылка.Ф_ВидыОпераций", Истина)
			.СПараметрами("РегистрСведенийКлючЗаписи.Ф_КомментарииПоОбъекту", Ложь)
			.СПараметрами("Булево", Ложь)
			.СПараметрами("Неопределено", Ложь)
		.ДобавитьТест("ТипПоИмениТаблицы")
			.СПараметрами("Справочник.Ф_Номенклатура", "Ссылка", "СправочникСсылка.Ф_Номенклатура")
			.СПараметрами("Документ.Ф_Чек", "Менеджер", "ДокументМенеджер.Ф_Чек")
			.СПараметрами("Перечисление.Ф_ТипыОбъектов", "Ссылка", "ПеречислениеСсылка.Ф_ТипыОбъектов")
			.СПараметрами("РегистрСведений.Ф_ПериодическаяКонстанта", "НаборЗаписей", "РегистрСведенийНаборЗаписей.Ф_ПериодическаяКонстанта")
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", "КлючЗаписи", "РегистрНакопленияКлючЗаписи.Ф_ОстаткиТоваров")
		.ДобавитьТест("ЭтоСоставнойТип")
			.СПараметрами("СправочникСсылка.Ф_Номенклатура", Ложь)
			.СПараметрами("Строка, СправочникСсылка.Ф_Номенклатура", Истина)
			.СПараметрами("Неопределено, СправочникСсылка.Ф_Номенклатура", Ложь)
			.СПараметрами("Null, СправочникСсылка.Ф_Номенклатура", Ложь)
			.СПараметрами("Число, Строка", Истина)
		.ДобавитьТест("ПредставлениеТипа")
			.СПараметрами("СправочникСсылка.Ф_ОбъектыМетаданных", "CatalogRef.Ф_ОбъектыМетаданных")
			.СПараметрами("Строка", "string")
			.СПараметрами("Число", "decimal")
	;
	
КонецПроцедуры

Процедура ТипПоПредставлению(Представление, ОжидаемыйТип) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ТипПоПредставлению(Представление))
		.Равно(ОжидаемыйТип);
	
КонецПроцедуры

Процедура ЭтоСсылочныйТип(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ЭтоСсылочныйТип(Тип(ИмяТипа)))
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ТипПоИмениТаблицы(Имя, Суффикс, ОжидаемыйТип) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ТипПоИмениТаблицы(Имя, Суффикс))
		.Равно(Тип(ОжидаемыйТип));
	
КонецПроцедуры

Процедура ЭтоСоставнойТип(ОписаниеТипа, ОжидаемыйРезультат) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ЭтоСоставнойТип(Новый ОписаниеТипов(ОписаниеТипа)))
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ПредставлениеТипа(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ПредставлениеТипа(Тип(ИмяТипа)))
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
