//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТестовыйНабор("Виртуальные таблицы. Регистры накопления")
			.ДобавитьТест("Запрос_БезПараметров_ВыдаетОшибку")
				.СПараметрами("Остатки")
				.СПараметрами("Обороты")
				.СПараметрами("ОстаткиИОбороты")
				.СПараметрами("СрезПервых")
				.СПараметрами("СрезПоследних")
			.ДобавитьТест("Запрос_ПоВсемДанным")
				.СПараметрами("Остатки")
				.СПараметрами("Обороты")
				.СПараметрами("ОстаткиИОбороты")
			.ДобавитьТест("Запрос_ПроверкаКолонок")
				.СПараметрами("Остатки",
							  "Номенклатура, Склад, КоличествоОстаток, СуммаОстаток")
				.СПараметрами("Обороты",
							  "Номенклатура, Склад, КоличествоОборот, КоличествоПриход, КоличествоРасход, СуммаОборот, СуммаПриход, СуммаРасход")
				.СПараметрами("ОстаткиИОбороты",
							  "Номенклатура, Склад," +
							  "КоличествоНачальныйОстаток, КоличествоКонечныйОстаток, КоличествоОборот, КоличествоПриход, КоличествоРасход," +
							  "СуммаНачальныйОстаток, СуммаКонечныйОстаток, СуммаОборот, СуммаПриход, СуммаРасход")
			.ДобавитьТест("Запрос_СписокВыводимыхКолонок")
				.СПараметрами("Остатки",
							  "Номенклатура, КоличествоОстаток")
				.СПараметрами("Обороты",
							  "Склад, КоличествоОборот, СуммаОборот, СуммаПриход, СуммаРасход")
				.СПараметрами("ОстаткиИОбороты",
							  "Номенклатура," +
							  "КоличествоНачальныйОстаток, КоличествоКонечныйОстаток, КоличествоОборот," +
							  "СуммаНачальныйОстаток, СуммаКонечныйОстаток, СуммаОборот")
			.ДобавитьТест("Запрос_СПериодичность")
				.СПараметрами("Обороты", "Регистратор")
				.СПараметрами("ОстаткиИОбороты", "День")
		.ДобавитьТестовыйНабор("Виртуальные таблицы. Регистры сведений")
			.ДобавитьТест("ЗапросСреза")
				.СПараметрами("СрезПоследних", "Комментарий2")
				.СПараметрами("СрезПервых", "Комментарий1")
	;
		
КонецПроцедуры

Процедура Запрос_БезПараметров_ВыдаетОшибку(Обработчик) Экспорт
	
	Статус = ЗапросКРегиструНакоплений(Обработчик, Неопределено);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, , ПомощникТестированияРат.КлассыОшибок().РазборПараметровЗапроса);
	
КонецПроцедуры

Процедура Запрос_ПроверкаКолонок(Обработчик, ИменаКолонок) Экспорт
	
	Колонки = ЮТСтроки.РазделитьСтроку(ИменаКолонок, ",");
	Номенклатура = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	Статус = ЗапросКРегиструНакоплений(Обработчик, ПараметрыОбработчика(Новый Структура("Номенклатура", Номенклатура)), Номенклатура);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	Утверждение = ЮТест.ОжидаетЧто(Статус.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.ИмеетДлину(2)
		.Свойство("Колонки").ИмеетДлину(Колонки.Количество());
	
	Для Каждого ИмяКолонки Из Колонки Цикл
		Утверждение.ИмеетСвойство(ИмяКолонки);
	КонецЦикла;
	
КонецПроцедуры

Процедура Запрос_ПоВсемДанным(Обработчик) Экспорт
	
	Статус = ЗапросКРегиструНакоплений(Обработчик, ПараметрыОбработчика(Новый Структура));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Статус.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.ИмеетДлину(2)
	;
	
КонецПроцедуры

Процедура Запрос_СписокВыводимыхКолонок(Обработчик, ИменаКолонок) Экспорт
	
	Колонки = ЮТСтроки.РазделитьСтроку(ИменаКолонок, ",");
	Номенклатура = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	Статус = ЗапросКРегиструНакоплений(Обработчик, ПараметрыОбработчика(Новый Структура(), Колонки), Номенклатура);
	
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	Утверждение = ЮТест.ОжидаетЧто(Статус.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.Свойство("Колонки").ИмеетДлину(Колонки.Количество());
	
	Для Каждого ИмяКолонки Из Колонки Цикл
		Утверждение.ИмеетСвойство(ИмяКолонки);
	КонецЦикла;
	
КонецПроцедуры

Процедура Запрос_СПериодичность(Обработчик, Периодичность) Экспорт
	
	ПараметрыОбработчика = ПараметрыОбработчика(Новый Структура);
	ПараметрыОбработчика.Вставить("Периодичность", Периодичность);
	
	Статус = ЗапросКРегиструНакоплений(Обработчик, ПараметрыОбработчика);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Статус.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.ИмеетДлину(2)
		.Свойство("Колонки")
			.ИмеетСвойство("Период");
	;
	
КонецПроцедуры

Процедура ЗапросСреза(Обработчик, РеквизитОжидаемогоЗначения) Экспорт
	
	ПараметрыЗапроса = ПараметрыЗапроса("РегистрыСведений/Ф_КомментарииПоОбъекту", Обработчик);
	Данные = ДанныеПроверкиСреза();
	
	ПараметрыЗапроса.Тело = ПараметрыОбработчика(Новый Структура("Объект", Данные.Объект));
	Статус = ВызватьОбработчик(ПараметрыЗапроса);
	
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Статус.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.ИмеетДлину(1)
		.Свойство("Колонки")
			.ИмеетДлину(3)
			.ИмеетСвойство("Период")
			.ИмеетСвойство("Объект")
			.ИмеетСвойство("Комментарий")
		.Свойство("[0].Комментарий").Равно(Данные[РеквизитОжидаемогоЗначения]);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыЗапроса(Адрес, Обработчик)
	
	Параметры = Новый Структура("Обработчик, Адрес, ", Обработчик, Адрес + "/" + Обработчик);
	Параметры.Вставить("КлассыОшибок", ПомощникТестированияРат.КлассыОшибок());
	Параметры.Вставить("Тело", Неопределено);
	
	Возврат Параметры;
	
КонецФункции

Процедура ДобавитьОстатки(Номенклатура = Неопределено, Склад = Неопределено)
	
	Чек = ЮТест.Данные().СоздатьДокумент(Документы.Ф_Чек);
	ЮТест.Данные().КонструкторДвижений(Чек, "Ф_ОстаткиТоваров")
		.ДобавитьСтроку()
			.Установить("Номенклатура", Номенклатура)
			.Установить("Склад", Склад)
			.ФикцияНезаполненных("Склад, Номенклатура") // Установим значения если не переданы
			.ФикцияРеквизитов("Количество, Сумма")
		.Записать();
	
КонецПроцедуры

Функция ДанныеПроверкиСреза()
	
	Описание = Новый Структура;
	Описание.Вставить("Период", ТекущаяДатаСеанса());
	Описание.Вставить("Объект", ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура));
	Описание.Вставить("Комментарий1", "1");
	Описание.Вставить("Комментарий2", "2");
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(РегистрыСведений.Ф_КомментарииПоОбъекту);
	
	Конструктор
		.Установить("Период", Описание.Период)
		.Установить("Объект", Описание.Объект)
		.Установить("Комментарий", Описание.Комментарий1)
		.Записать();
	Конструктор
		.Установить("Период", Описание.Период + 1)
		.Установить("Объект", Описание.Объект)
		.Установить("Комментарий", Описание.Комментарий2)
		.Записать();
	
	Возврат Описание;
	
КонецФункции

Функция ПараметрыОбработчика(Условия = Неопределено, Поля = Неопределено, Количество = Неопределено)
	
	Тело = Новый Структура;
	
	Если Условия <> Неопределено Тогда
		Тело.Вставить("Условия", Условия);
	КонецЕсли;
	
	Если Поля <> Неопределено Тогда
		Тело.Вставить("Поля", Поля);
	КонецЕсли;
	
	Если Количество <> Неопределено Тогда
		Тело.Вставить("Количество", Количество);
	КонецЕсли;
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросКРегиструНакоплений(Обработчик, Тело, Номенклатура = Неопределено)
	
	ПараметрыЗапроса = ПараметрыЗапроса("РегистрыНакопления/Ф_ОстаткиТоваров", Обработчик);
	ПараметрыЗапроса.Тело = Тело;
	
	ДобавитьОстатки(Номенклатура);
	ДобавитьОстатки(Номенклатура);
	
	Возврат ВызватьОбработчик(ПараметрыЗапроса);
	
КонецФункции

Функция ВызватьОбработчик(ПараметрыЗапроса, ПараметрыОбработчика = Неопределено)
	
	Тело = ПараметрыОбработчика;
	Если Тело = Неопределено Тогда
		Тело = ПараметрыЗапроса.Тело;
	КонецЕсли;
	
	Возврат ПомощникТестированияРат.ВызватьОбработчик(РатВиртуальныеТаблицы,
													  ПараметрыЗапроса.Обработчик,
													  ПараметрыЗапроса.Адрес,
													  Тело);

КонецФункции

#КонецОбласти
