//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ЭтоПримитивныйТип")
		.ДобавитьТест("ОбъектИзСтрокиСПриведением_КлючиСДефисом")
	;
	
КонецПроцедуры

Процедура ЭтоПримитивныйТип() Экспорт
	
	Варианты = Новый Массив();
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Строка"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Число"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Булево"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Строка"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Неопределено"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Дата"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("УникальныйИдентификатор"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Массив"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("СправочникСсылка.ПУБ_Номенклатура"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("РегистрСведенийКлючЗаписи.ПУБ_КомментарииПоОбъекту"), Ложь));
	
	Для Каждого Вариант Из Варианты Цикл
		
		Результат = РатJSON.ЭтоПримитивныйТипJSON(Вариант.Тип);
		ЮТест.ОжидаетЧто(Результат, "ЭтоПримитивныйТип для " + Вариант.Тип)
			.Равно(Вариант.Результат, "верно определен примитивный тип");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбъектИзСтрокиСПриведением_КлючиСДефисом() Экспорт

	СтрокаJSON = "{""valid"":{""nested"":1},""invalid-key"":""Значение"",""items"":[{""name"":""Элемент""}]}";

	Результат = РатJSON.ОбъектИзСтрокиСПриведением(СтрокаJSON);

	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("Соответствие");
	ЮТест.ОжидаетЧто(Результат.Получить("invalid-key"))
		.Равно("Значение");
	ЮТест.ОжидаетЧто(Результат.Получить("valid"))
		.ИмеетТип("Структура")
		.Свойство("nested").Равно(1);
	ЮТест.ОжидаетЧто(Результат.Получить("items"))
		.ИмеетТип("Массив")
		.ИмеетДлину(1);
	ЮТест.ОжидаетЧто(Результат.Получить("items").Получить(0))
		.ИмеетТип("Структура")
		.Свойство("name").Равно("Элемент");

КонецПроцедуры

#КонецОбласти
