//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

Процедура ПриЗаписиОбъекта(Источник, Отказ) Экспорт
	
	Если НЕ РатСборДанных.ИспользуетсяСборДанных() Тогда
		Возврат;
	КонецЕсли;
	
	РатСборДанных.ЗафиксироватьЗаписьОбъекта(Источник);
	
КонецПроцедуры

Процедура ПриЗаписиДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ РатСборДанных.ИспользуетсяСборДанных() Тогда
		Возврат;
	КонецЕсли;
	
	РатСборДанных.ЗафиксироватьЗаписьОбъекта(Источник);
	
КонецПроцедуры

Процедура ПриЗаписиРегистра(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ РатСборДанных.ИспользуетсяСборДанных() Тогда
		Возврат;
	КонецЕсли;
	
	РатСборДанных.ЗафиксироватьЗаписьОбъекта(Источник);
	
КонецПроцедуры

Процедура ПриЗаписиРегистраРасчета(Источник, Отказ, Замещение, ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
	
	Если НЕ РатСборДанных.ИспользуетсяСборДанных() Тогда
		Возврат;
	КонецЕсли;
	
	РатСборДанных.ЗафиксироватьЗаписьОбъекта(Источник);
	
КонецПроцедуры

Процедура ПередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ РатСборДанных.ИспользуетсяСборДанных() Тогда
		Возврат;
	КонецЕсли;
	
	РатСборДанных.ПередЗаписьюРегистра(Источник, Замещение);
	
КонецПроцедуры

Процедура ПередЗаписьюРегистраРасчета(Источник, Отказ, Замещение, ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
	
	Если НЕ РатСборДанных.ИспользуетсяСборДанных() Тогда
		Возврат;
	КонецЕсли;
	
	РатСборДанных.ПередЗаписьюРегистра(Источник, Замещение);
	
КонецПроцедуры

#КонецОбласти
