//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ДанныеТабличнойЧасти")
		.ДобавитьТест("ДобавитьЗаписиТабличнойЧасти")
		.ДобавитьТест("УдалитьЗаписиТабличнойЧасти_ПоРеквизиту")
		.ДобавитьТест("УдалитьЗаписиТабличнойЧасти_ПоНомеруСтроки")
		.ДобавитьТест("УдалитьЗаписиТабличнойЧасти_НетПодходящихЗаписей")
		.ДобавитьТест("УдалитьЗаписиТабличнойЧасти_НетПодходящихЗаписейИОтключенВыборосОшибок")
		.ДобавитьТест("УдалитьЗаписиТабличнойЧасти_ЛишниеПоляФильтра")
		.ДобавитьТест("УдалитьЗаписиТабличнойЧасти_Очистка")
		.ДобавитьТест("ИзменитьЗаписиТабличнойЧасти_ИзменениеСтроки")
		.ДобавитьТест("ИзменитьЗаписиТабличнойЧасти_ИзменениеСтроки_НеНайденаЗапись")
		.ДобавитьТест("ИзменитьЗаписиТабличнойЧасти_ДобавлениеСтроки_НайденаЗапись")
		.ДобавитьТест("ИзменитьЗаписиТабличнойЧасти_ДобавлениеСтроки_НеНайденаЗапись")
	;
	
КонецПроцедуры

Процедура ДанныеТабличнойЧасти() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(2);
	Описание = "Получение данных табличной части";
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	Статус = ВызовОбработчикаПолученияДанныхТабличнойЧасти(Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	
	ЮТест.ОжидаетЧто(Статус.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.Свойство("[0].ИмяРеквизита")
			.Равно(Объект.Реквизиты[0].ИмяРеквизита)
		.Свойство("[1].ИмяРеквизита")
			.Равно(Объект.Реквизиты[1].ИмяРеквизита)
		.Свойство("[1].НомерСтроки")
			.Равно(2);
	
КонецПроцедуры

Процедура ДобавитьЗаписиТабличнойЧасти() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(0);
	
	Описание = "Добавление записей в тч Справочники.Ф_ОбъектыМетаданных.Реквизиты";
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	ДанныеТабличнойЧасти = Новый Массив;
	ДанныеТабличнойЧасти.Добавить(Новый Структура("ИмяРеквизита", ЮТест.Данные().СлучайнаяСтрока()));
	
	Статус = ВызовОбработчикаДобавленияЗаписейТабличнойЧасти(Адрес, Новый Структура("data", ДанныеТабличнойЧасти));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(1)
		.Свойство("Реквизиты[0].ИмяРеквизита")
			.Равно(ДанныеТабличнойЧасти[0].ИмяРеквизита);
	
КонецПроцедуры

Процедура УдалитьЗаписиТабличнойЧасти_ПоРеквизиту() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(3);
	ДанныеТабличнойЧасти = Объект.Реквизиты.Выгрузить();
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	Тело = Новый Структура("filter", Новый Структура("ИмяРеквизита", ДанныеТабличнойЧасти[1].ИмяРеквизита));
	
	Статус = ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(2)
		.Свойство("Реквизиты[0].ИмяРеквизита")
			.Равно(ДанныеТабличнойЧасти[0].ИмяРеквизита)
		.Свойство("Реквизиты[1].ИмяРеквизита")
			.Равно(ДанныеТабличнойЧасти[2].ИмяРеквизита);
	
КонецПроцедуры

Процедура УдалитьЗаписиТабличнойЧасти_ПоНомеруСтроки() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(3);
	ДанныеТабличнойЧасти = Объект.Реквизиты.Выгрузить();
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	Тело = Новый Структура("filter", Новый Структура("НомерСтроки", 2));
	
	Статус = ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(2)
		.Свойство("Реквизиты[0].ИмяРеквизита")
			.Равно(ДанныеТабличнойЧасти[0].ИмяРеквизита)
		.Свойство("Реквизиты[1].ИмяРеквизита")
			.Равно(ДанныеТабличнойЧасти[2].ИмяРеквизита);
	
КонецПроцедуры

Процедура УдалитьЗаписиТабличнойЧасти_НетПодходящихЗаписей() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(4);
	ДанныеТабличнойЧасти = Объект.Реквизиты.Выгрузить();
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	Фильтр = Новый Структура("НомерСтроки, ИмяРеквизита", 2, ДанныеТабличнойЧасти[0].ИмяРеквизита);
	Тело = Новый Структура("filter", Фильтр);
	
	Статус = ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(4);
	
КонецПроцедуры

Процедура УдалитьЗаписиТабличнойЧасти_НетПодходящихЗаписейИОтключенВыборосОшибок() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(4);
	ДанныеТабличнойЧасти = Объект.Реквизиты.Выгрузить();
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	Фильтр = Новый Структура("НомерСтроки, ИмяРеквизита", 2, ДанныеТабличнойЧасти[0].ИмяРеквизита);
	Тело = Новый Структура("filter, settings", Фильтр, Новый Структура("throwException", False));
	
	Статус = ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(4);
	
КонецПроцедуры

Процедура УдалитьЗаписиТабличнойЧасти_ЛишниеПоляФильтра() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(4);
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	Фильтр = Новый Структура("Цвет, НомерСтроки", 2, 2);
	
	Статус = ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Новый Структура("filter", Фильтр));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(4);
	
КонецПроцедуры

Процедура УдалитьЗаписиТабличнойЧасти_Очистка() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(5);
	
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	
	Фильтр = Новый Структура;
	
	Статус = ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Новый Структура("filter", Фильтр));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").НеЗаполнено();
	
КонецПроцедуры

Процедура ИзменитьЗаписиТабличнойЧасти_ИзменениеСтроки() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(2);
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	
	НовоеЗначение = Новый Структура("НомерСтроки, ИмяРеквизита", 1, ЮТест.Данные().СлучайнаяСтрока());
	Тело = Новый Структура("filterBy, data", "НомерСтроки", НовоеЗначение);
	
	Статус = ВызовОбработчикаИзмененияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(2)
		.Свойство("Реквизиты[0].ИмяРеквизита").Равно(НовоеЗначение.ИмяРеквизита);
	
КонецПроцедуры

Процедура ИзменитьЗаписиТабличнойЧасти_ИзменениеСтроки_НеНайденаЗапись() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(2);
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	
	НовоеЗначение = Новый Структура("НомерСтроки, ИмяРеквизита", 99, ЮТест.Данные().СлучайнаяСтрока());
	Тело = Новый Структура("filterBy, data", "НомерСтроки", НовоеЗначение);
	
	Статус = ВызовОбработчикаИзмененияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус);
	
КонецПроцедуры

Процедура ИзменитьЗаписиТабличнойЧасти_ДобавлениеСтроки_НайденаЗапись() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(2);
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	
	НовоеЗначение = Новый Структура("НомерСтроки, ИмяРеквизита", 1, ЮТест.Данные().СлучайнаяСтрока());
	Тело = Новый Структура("filterBy, data, settings",
						   "НомерСтроки",
						   НовоеЗначение,
						   Новый Структура("append", Истина));
	Статус = ВызовОбработчикаИзмененияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(2)
		.Свойство("Реквизиты[0].ИмяРеквизита").Равно(НовоеЗначение.ИмяРеквизита);
	
КонецПроцедуры

Процедура ИзменитьЗаписиТабличнойЧасти_ДобавлениеСтроки_НеНайденаЗапись() Экспорт
	
	Объект = ЭлементСправочникаСТабличнойЧастью(2);
	Адрес = СтрШаблон("Справочник/Ф_ОбъектыМетаданных/%1/Реквизиты", Объект);
	
	НовоеЗначение = Новый Структура("НомерСтроки, ИмяРеквизита", 999, ЮТест.Данные().СлучайнаяСтрока());
	Тело = Новый Структура("filterBy, data, settings",
						   "НомерСтроки",
						   НовоеЗначение,
						   Новый Структура("append", Истина));
	Статус = ВызовОбработчикаИзмененияЗаписейТабличнойЧасти(Адрес, Тело);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧто(Объект)
		.Свойство("Реквизиты").ИмеетДлину(3)
		.Свойство("Реквизиты[2].ИмяРеквизита").Равно(НовоеЗначение.ИмяРеквизита);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызовОбработчикаПолученияДанныхТабличнойЧасти(Адрес)

	Возврат ВызватьОбработчик("ДанныеТабличнойЧасти", Адрес);

КонецФункции

Функция ВызовОбработчикаДобавленияЗаписейТабличнойЧасти(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("ДобавитьЗаписиТабличнойЧасти", Адрес, Тело);

КонецФункции

Функция ВызовОбработчикаУдаленияЗаписейТабличнойЧасти(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("УдалитьЗаписиТабличнойЧасти", Адрес, Тело);

КонецФункции

Функция ВызовОбработчикаИзмененияЗаписейТабличнойЧасти(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("ИзменитьЗаписиТабличнойЧасти", Адрес, Тело);

КонецФункции

Функция ВызватьОбработчик(Обработчик, Адрес, Тело = Неопределено)
	
	Возврат ПомощникТестированияРат.ВызватьОбработчик(РатТабличныеЧасти, Обработчик, Адрес, Тело);
	
КонецФункции

Функция ЭлементСправочникаСТабличнойЧастью(КоличествоЗаписей)
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(Справочники.Ф_ОбъектыМетаданных)
		.Фикция("Наименование")
		.ТабличнаяЧасть("Реквизиты");
	
	Для Инд = 1 По КоличествоЗаписей Цикл
		Конструктор
			.ДобавитьСтроку()
			.ФикцияРеквизитов("ИмяРеквизита, ПредставлениеТипа")
	КонецЦикла;
	
	Возврат Конструктор.Записать();
	
КонецФункции

#КонецОбласти
