//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ПолучитьВсеДвижения")
		.ДобавитьТест("ПолучитьДвиженияПоРегистру")
		.ДобавитьТест("УстановитьДвижения")
			.СПараметрами(0).Представление("Очистка движений", Истина)
			.СПараметрами(2).Представление("Новый набор движений", Истина)
	;
	
КонецПроцедуры

Процедура ПолучитьВсеДвижения() Экспорт
	
	Чек = ДокументСДвижениями();
	
	Адрес = СтрШаблон("Документы/Ф_Чек/%1/Движения", Чек.Номер);
	Статус = ВызватьОбработчик("ПолучитьВсеДвижения", Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Получение движений документа");
	
	ЮТест.ОжидаетЧто(Статус)
		.Свойство("Результат")
			.Заполнено()
			.ИмеетТип("Структура")
		.Свойство("Результат.Ф_ОстаткиТоваров").ИмеетДлину(1);
	
КонецПроцедуры

Процедура ПолучитьДвиженияПоРегистру() Экспорт
	
	Чек = ДокументСДвижениями();
	
	Адрес = СтрШаблон("Документы/Ф_Чек/%1/Движения/Ф_ОстаткиТоваров", Чек.Номер);
	Статус = ВызватьОбработчик("ПолучитьДвиженияПоРегистру", Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Получение движений документа по ОстаткиТоваров");
	
	ЮТест.ОжидаетЧто(Статус)
		.Свойство("Результат")
			.Заполнено()
			.ИмеетТип("ТаблицаЗначений")
			.ИмеетДлину(1);
	
КонецПроцедуры

Процедура УстановитьДвижения(Количество) Экспорт
	
	Чек = ДокументСДвижениями();
	Движения = Чек.ПолучитьОбъект().Движения.Ф_ОстаткиТоваров;
	Движения.Прочитать();
	ЮТест.ОжидаетЧто(Движения, "Движения до корректировки")
		.ИмеетДлину(1);
	
	Реквизиты = "Регистратор, Период, ВидДвижения, Номенклатура, Количество, Сумма";
	
	НовыеДвижения = Новый Массив;
	
	Период = '20251231';
	
	Для Инд = 1 По Количество Цикл
		НовыеДвижения.Добавить(Новый Структура(Реквизиты,
											   Чек,
											   Период,
											   "Приход",
											   ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура),
											   Инд,
											   Инд * 3));
	КонецЦикла;
	
	Адрес = СтрШаблон("Документы/Ф_Чек/%1/Движения/Ф_ОстаткиТоваров", Чек.Номер);
	Статус = ВызватьОбработчик("УстановитьДвижения", Адрес, Новый Структура("data", НовыеДвижения));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Установка движений документа по ОстаткиТоваров");
	
	Движения = Чек.ПолучитьОбъект().Движения.Ф_ОстаткиТоваров;
	Движения.Прочитать();
	ЮТест.ОжидаетЧто(Движения, "Движения после корректировки")
		.ИмеетДлину(Количество);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументСДвижениями()
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(Документы.Ф_Чек);
	Чек = Конструктор
		.ФикцияОбязательныхПолей()
		.Фикция("КассоваяСмена")
		.ТабличнаяЧасть("ТоварыУслуги")
			.ДобавитьСтроку()
				.Фикция("Номенклатура")
				.Установить("Цена", ЮТест.Данные().СлучайноеПоложительноеЧисло(9999, 2))
				.Установить("Количество", ЮТест.Данные().СлучайноеЧисло(1, 100))
				.Установить("Сумма", Конструктор.ДанныеСтроки().Цена * Конструктор.ДанныеСтроки().Количество)
		.Провести();
	
	Возврат Чек;
	
КонецФункции

Функция ВызватьОбработчик(Обработчик, Адрес, Тело = Неопределено)

	Возврат ПомощникТестированияРат.ВызватьОбработчик(РатДвижения, Обработчик, Адрес, Тело);

КонецФункции

#КонецОбласти
