//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных
&НаКлиенте
Перем СравнениеВерсийИнициализировано;
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьСравнениеВерсий();
	
	ОбновитьСтатус();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СравнениеВерсийДокументСформирован(Элемент)
	
	СравнениеВерсийИнициализировано = Истина;
	ОтобразитьСравнениеВерсий();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъекты

&НаКлиенте
Процедура ОбъектыПриАктивизацииСтроки(Элемент)
	
	ОтобразитьСравнениеВерсий();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьСлежение(Команда)
	
	НачатьСлежениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСлежение(Команда)
	
	ЗавершитьСлежениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачатьСлежениеНаСервере()
	
	РатСборДанных.ИнициализироватьСборДанных();
	ОбновитьСтатус();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСлежениеНаСервере()
	
	Результат = РатСборДанных.ОстановитьСборДанныхИПолучитьЗаписи();
	ОбновитьСтатус();
	АдресХранилища = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
	Объекты.Очистить();
	
	Для Каждого Запись Из Результат.Записи Цикл
		Строка = Объекты.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Запись);
		Если Запись.ИндексПрошлойВерсии = Неопределено Тогда
			Строка.ИндексПрошлойВерсии = -1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатус()
	
	ИспользуетсяСборДанных = РатСборДанных.ИспользуетсяСборДанных();
	Элементы.ФормаНачатьСлежение.Доступность = НЕ ИспользуетсяСборДанных;
	Элементы.ФормаЗавершитьСлежение.Доступность = ИспользуетсяСборДанных;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеВерсии(Знач НомерВерсии, Знач АдресХранилища)
	
	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	Возврат Данные.ДанныеВерсий[НомерВерсии];
	
КонецФункции

&НаСервере
Процедура ИнициализироватьСравнениеВерсий()
	
	ДанныеМакета = Обработки.РатИщейка.ПолучитьМакет("РатСравнениеСервий").ПолучитьТекст();
	СравнениеВерсий = ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "/" + ПоместитьВоВременноеХранилище(ДанныеМакета, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСравнениеВерсий()
	
	Если СравнениеВерсийИнициализировано = Неопределено Или Элементы.Объекты.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Объекты.ТекущиеДанные;
	Если ТекущиеДанные.ИндексПрошлойВерсии <> -1 Тогда
		Версия1 = ДанныеВерсии(ТекущиеДанные.ИндексПрошлойВерсии, АдресХранилища);
	Иначе
		Версия1 = "";
	КонецЕсли;
	
	Версия2 = ДанныеВерсии(ТекущиеДанные.ИндексВерсии, АдресХранилища);
	
	ОкноБраузера = Элементы.СравнениеВерсий.Документ["defaultView"];
	ОкноБраузера.setVersions(Версия1, Версия2);
	
КонецПроцедуры

#КонецОбласти
