//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

/////////////////////////////////////////////////////////////////////////////////
// Заголовок
//  Описание
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяСборДанных() Экспорт
	
	Попытка
		
		Если НЕ ЭтоАдресВременногоХранилища(ПараметрыСеанса.РатАдресВременногоКонтекста) Тогда
			ИнициализироватьСборДанных(); // TODO Временное для отладки
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение
		
		// Ошибка возникает при подключении в безопасном режиме
		Возврат Ложь; // TODO: Не отрабатывает установка параметра из расширения
		
	КонецПопытки;
	
КонецФункции

Функция ИнициализироватьСборДанных() Экспорт
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый Массив, Новый УникальныйИдентификатор());
	ПараметрыСеанса.РатАдресВременногоКонтекста = АдресХранилища;
	
	Возврат АдресХранилища;
	
КонецФункции

Процедура ЗафиксироватьЗаписьОбъекта(Источник) Экспорт
	
	Сообщить("Добавлен объект: " + Источник);
	Сообщить("Стек: " + ПолучитьСтек());
	АдресХранилища = ПараметрыСеанса.РатАдресВременногоКонтекста;
	Записи = ПолучитьИзВременногоХранилища(АдресХранилища);
	Записи.Добавить(Источник);
	
	ПоместитьВоВременноеХранилище(Записи, АдресХранилища);
	
КонецПроцедуры

Процедура ПередЗаписьюРегистра(Источник, Замещение) Экспорт
	
КонецПроцедуры

Функция ПолучитьСтек()
	
	Попытка
		Результат = 1/0;
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Стек = Новый Массив;
	
	ПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Для Каждого Строка Из СтрРазделить(ПредставлениеОшибки, Символы.ПС) Цикл
		
		Если СтрНачинаетсяС(Строка, "{") И НЕ СтрНачинаетсяС(Строка, "{RAT ОбщийМодуль.РатСборДанных") Тогда
			Стек.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Стек, Символы.ПС);
	
КонецФункции

#КонецОбласти
