//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

Функция ИспользуетсяСборДанных() Экспорт
	
	Попытка
		
		Возврат ЭтоАдресВременногоХранилища(ПараметрыСеанса.РатАдресВременногоКонтекста);
		
	Исключение
		
		// Ошибка возникает при подключении в безопасном режиме
		Возврат Ложь; // TODO: Не отрабатывает установка параметра из расширения
		
	КонецПопытки;
	
КонецФункции

Функция ИнициализироватьСборДанных() Экспорт
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый Массив, Новый УникальныйИдентификатор());
	ПараметрыСеанса.РатАдресВременногоКонтекста = АдресХранилища;
	
	Возврат АдресХранилища;
	
КонецФункции

Процедура ОстановитьСборДанных() Экспорт
	
	ПараметрыСеанса.РатАдресВременногоКонтекста = "";
	
КонецПроцедуры

Функция ОстановитьСборДанныхИПолучитьЗаписи() Экспорт
	
	Если НЕ ЭтоАдресВременногоХранилища(ПараметрыСеанса.РатАдресВременногоКонтекста) Тогда
		ВызватьИсключение "Получение записей для незапущенного сбора данных";
	КонецЕсли;
	
	Записи = ПолучитьИзВременногоХранилища(ПараметрыСеанса.РатАдресВременногоКонтекста);
	ПараметрыСеанса.РатАдресВременногоКонтекста = "";
	
	Возврат Записи;
	
КонецФункции

Процедура ЗафиксироватьЗаписьОбъекта(Источник) Экспорт
	
	АдресХранилища = ПараметрыСеанса.РатАдресВременногоКонтекста;
	
	Если НЕ ЭтоАдресВременногоХранилища(ПараметрыСеанса.РатАдресВременногоКонтекста) Тогда
		ВызватьИсключение "Фиксация события записи до инициализации сбора данных";
	КонецЕсли;
	
	Записи = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Запись = НовыйОписаниеЗаписи();
	Запись.Данные = Источник;
	Запись.Стек = ПолучитьСтек();
	Запись.Время = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Записи.Добавить(Запись);
	
	ПоместитьВоВременноеХранилище(Записи, АдресХранилища);
	
КонецПроцедуры

Функция НовыйОписаниеЗаписи() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Данные");
	Описание.Вставить("Стек");
	Описание.Вставить("Время");
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередЗаписьюРегистра(Источник, Замещение) Экспорт
	
КонецПроцедуры

Функция ПолучитьСтек()
	
	Попытка
		Результат = 1/0;
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Стек = Новый Массив;
	
	ПредставлениеОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Для Каждого Строка Из СтрРазделить(ПредставлениеОшибки, Символы.ПС) Цикл
		
		Если СтрНачинаетсяС(Строка, "{") И НЕ СтрНачинаетсяС(Строка, "{RAT ОбщийМодуль.РатСборДанных") Тогда
			Стек.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Стек, Символы.ПС);
	
КонецФункции

#КонецОбласти
