//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("МетаданныеТаблицы")
			.СПараметрами("Справочник.Ф_ОбъектыМетаданных", "Ссылка, Код, Наименование, Тип")
			.СПараметрами("Документ.Ф_Чек", "Дата, Номер")
			.СПараметрами("Перечисление.Ф_ВидыОпераций", "Порядок")
			.СПараметрами("РегистрСведений.Ф_ПримитивныеИзмерения", "Число, Булево")
			.СПараметрами("РегистрСведений.Ф_ПериодическаяКонстанта", "Период, Значение")
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", "Регистратор, Период, Склад")
		
		.ДобавитьТест("ОбъектМетаданных")
			.СПараметрами("Справочник.Ф_ОбъектыМетаданных")
			.СПараметрами("Документы.Ф_Чек")
			.СПараметрами("Перечисление.Ф_ВидыОпераций")
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров")
		
		.ДобавитьТест("ДоступноРедактирование")
		.ДобавитьТест("ЭтоТаблицаОбъектныхДанных")
		.ДобавитьТест("ТипыМетаданных")
		.ДобавитьТест("РеквизитыОбъектаМетаданных")
		.ДобавитьТест("СтруктураТаблицы")
		.ДобавитьТест("КлючевыеПоляТаблицы")
			.СПараметрами("Справочник.Ф_Номенклатура", "Ссылка")
			.СПараметрами("РегистрСведений.Ф_КомментарииПоОбъекту", "Период, Объект")
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", "Регистратор, НомерСтроки")
		
		.ДобавитьТест("ТипРеквизита")
			.СПараметрами("Документ.Ф_Чек.Ссылка", Новый ОписаниеТипов("ДокументСсылка.Ф_Чек"))
			.СПараметрами("Документ.Ф_Чек.ТоварыУслуги.Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Ф_Номенклатура"))
			.СПараметрами("Документ.Ф_Чек.ВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.Ф_ВидыОпераций"))
			.СПараметрами("РегистрСведений.Ф_ПримитивныеИзмерения.Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)))
		
		.ДобавитьТест("ТипМетаданных")
		
		.ДобавитьТест("МенеджерТаблицы")
			.СПараметрами("Справочник.Ф_Номенклатура", Истина)
			.СПараметрами("Документ.Ф_Чек", Истина)
			.СПараметрами("Перечисление.Ф_ВидыОпераций", Истина)
			.СПараметрами("РегистрСведений.Ф_КомментарииПоОбъекту", Истина)
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", Истина)
			.СПараметрами("Справочник.НеНоменклатура", Ложь)
			.СПараметрами("Документы.Ф_Чек", Ложь)
			.СПараметрами("Перечисление", Ложь)
		
		.ДобавитьТест("ТаблицыДвижений")
		.ДобавитьТест("ПолноеИмяТаблицыДвижений")
		
		.ДобавитьТест("РазложитьИмяТаблицы")
		.ДобавитьТест("ТаблицаСодержитПредопределенный")
			.СПараметрами("Справочник.Ф_Склады", "ОсновнойСклад", Истина)
			.СПараметрами("Справочник.Ф_Склады", "ГиперСклад", Ложь)
			.СПараметрами("Перечисление.Ф_ВидыОпераций", "Приход", Ложь)
			.СПараметрами("Перечисление.Ф_ВидыОпераций", "Уход", Ложь)
		
		.ДобавитьТест("ЭтоТипКлючаЗаписи")
			.СПараметрами("РегистрСведенийКлючЗаписи.Ф_ИзмерениеСоставнойРеквизит", Истина)
			.СПараметрами("СправочникСсылка.Ф_Склады", Ложь)
		
		.ДобавитьТест("ЭтоТипПеречисления")
			.СПараметрами("ПеречислениеСсылка.Ф_ВидыОпераций", Истина)
			.СПараметрами("ПеречислениеМенеджер.Ф_ВидыОпераций", Истина)
			.СПараметрами("Неопределено", Ложь)
		
		.ДобавитьТест("ЭтоРегистрСведений")
			.СПараметрами("РегистрСведенийКлючЗаписи.Ф_ИзмерениеСоставнойРеквизит", Истина)
			.СПараметрами("РегистрСведенийНаборЗаписей.Ф_ИзмерениеСоставнойРеквизит", Истина)
			.СПараметрами("РегистрНакопленияНаборЗаписей.Ф_ОстаткиТоваров", Ложь)
		
		.ДобавитьТест("ТаблицаСодержитОбъектныеДанные")
		
		.ДобавитьТест("ОтборРегистра")
			.СПараметрами("РегистрСведений.Ф_КомментарииПоОбъекту", ЮТКоллекции.ЗначениеВМассиве("Период", "Объект"))
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", ЮТКоллекции.ЗначениеВМассиве("Регистратор"))
		
		.ДобавитьТест("ЭтоТаблицаПеречисления")
			.СПараметрами("Перечисление.Ф_ВидыОпераций", Истина)
			.СПараметрами("Справочник.Ф_Номенклатура", Ложь)
			.СПараметрами("Документ.Ф_Чек", Ложь)
		
		.ДобавитьТест("ЭтоТаблицаДокумента")
			.СПараметрами("Документ.Ф_Чек", Истина)
			.СПараметрами("Справочник.Ф_Номенклатура", Ложь)
			.СПараметрами("Перечисление.Ф_ВидыОпераций", Ложь)
		
		.ДобавитьТест("ЭтоТаблицаПланаОбмена")
			.СПараметрами("ПланОбмена.Ф_ПВХ", Истина)
			.СПараметрами("Справочник.Ф_Номенклатура", Ложь)
			.СПараметрами("Документ.Ф_Чек", Ложь)
		
		.ДобавитьТест("ЭтоТаблицаРегистра")
			.СПараметрами("РегистрСведений.Ф_КомментарииПоОбъекту", Истина)
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", Истина)
			.СПараметрами("Справочник.Ф_Номенклатура", Ложь)
			.СПараметрами("Документ.Ф_Чек", Ложь)
		
		.ДобавитьТест("ЭтоТаблицаНезависимогоРегистрСведений")
			.СПараметрами("РегистрСведений.Ф_КомментарииПоОбъекту", Истина)
			.СПараметрами("РегистрНакопления.Ф_ОстаткиТоваров", Ложь)
			.СПараметрами("Справочник.Ф_Номенклатура", Ложь)
	;
КонецПроцедуры

Процедура МетаданныеТаблицы(Имя, ИменаРеквизитов) Экспорт
	
	Реквизиты = СтрРазделить(ИменаРеквизитов, ", ", Ложь);
	ЭтоРегистр = СтрНачинаетсяС(Имя, "Регистр");
	
	Статус = ПомощникТестированияРат.Статус();
	Результат = РатМетаданные.МетаданныеТаблицы(Имя, Статус);
	ЮТест.ОжидаетЧто(Результат, Имя)
		.Свойство("Реквизиты")
		.Свойство("КлючевыеРеквизиты")
		.Свойство("Имя")
		.Свойство("Представление")
		.Свойство("ЭтоРегистр").Равно(ЭтоРегистр);
	
	РеквизитыТаблицы = РатКоллекции.ВСоответствие(Результат.Реквизиты, "Имя");
	Для Каждого Реквизит Из Реквизиты Цикл
		ЮТест.ОжидаетЧто(РеквизитыТаблицы, Имя)
			.Свойство(Реквизит).ИмеетТип("Структура")
			.Свойство(Реквизит + ".Имя").Равно(Реквизит);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбъектМетаданных(Имя) Экспорт
	
	СтруктураИмени = РатМетаданные.РазложитьИмяТаблицы(Имя);
	Результат = РатМетаданные.ОбъектМетаданных(Имя);
	ЮТест.ОжидаетЧто(Результат, "По имени")
		.Существует()
		.ИмеетТип("ОбъектМетаданных");
	
	Результат2 = РатМетаданные.ОбъектМетаданных(СтруктураИмени);
	ЮТест.ОжидаетЧто(Результат2, "По структуре имени")
		.Существует()
		.ИмеетТип("ОбъектМетаданных")
		.Равно(Результат);
	
	ЮТест.ОжидаетЧто(Результат.Имя, "Проверка имени")
		.Равно(СтруктураИмени.ИмяВида);
	
КонецПроцедуры

Процедура ЭтоТаблицаОбъектныхДанных() Экспорт
	
	Варианты = ЮТТестовыеДанные.ТаблицаMarkDown(
	"| Имя                              | Результат |
	||----------------------------------|-----------|
	|| Справочник.Ф_Номенклатура      | +         |
	|| Документ.Ф_Чек                 | +         |
	|| Перечисление.Ф_ВидыОпераций    | +         |
	|| ПланВидовХарактеристик.Ф_ПВХ   | +         |
	|| РегистрыСведений.Ф_КомментарииПоОбъекту | -         |
	|| РегистрНакопления.Ф_ОстаткиТоваров | -         |");
	
	Для Каждого Вариант Из Варианты Цикл
		
		ОжидаемыйРезультат = Вариант.Результат = "+";
		Результат = РатМетаданные.ЭтоТаблицаОбъектныхДанных(Вариант.Имя);
		ЮТест.ОжидаетЧто(Результат, Вариант.Имя)
			.Равно(ОжидаемыйРезультат);
		
		СтруктураИмени = РатМетаданные.РазложитьИмяТаблицы(Вариант.Имя);
		Результат = РатМетаданные.ЭтоТаблицаОбъектныхДанных(СтруктураИмени);
		ЮТест.ОжидаетЧто(Результат, "По структуре имени " + Вариант.Имя)
			.Равно(ОжидаемыйРезультат);
		
	КонецЦикла;
КонецПроцедуры

Процедура ТипМетаданных() Экспорт
	
	Варианты = ЮТТестовыеДанные.ТаблицаMarkDown(
	"| Имя                    | Редактирование |
	|| ---------------------- | -------------- |
	|| Справочник             | +              |
	|| Документ               | +              |
	|| Перечисление           | -              |
	|| ПланВидовХарактеристик | +              |
	|| ПланСчетов             | +              |
	|| ПланВидовРасчета       | +              |
	|| РегистрСведений        | +              |
	|| РегистрНакопления      | -              |
	|| РегистрБухгалтерии     | -              |
	|| РегистрРасчета         | -              |
	|| БизнесПроцесс          | +              |
	|| Задача                 | +              |");
	
	Для Каждого Вариант Из Варианты Цикл
		
		ЮТест.ОжидаетЧто(РатМетаданные.ТипМетаданных(Вариант.Имя), Вариант.Имя)
			.Заполнено()
			.Свойство("ИмяКоллекции")
			.Свойство("Имя").Равно(Вариант.Имя)
			.Свойство("ОбъектныеДанные")
			.Свойство("Редактирование").Равно(Вариант.Редактирование = "+")
			.Свойство("КоллекцииРеквизитов")
			.Свойство("ТабличныеЧасти")
			.Свойство("Предопределенные")
			.Свойство("Поиск")
		;
	КонецЦикла;
	
КонецПроцедуры

Процедура МенеджерТаблицы(ИмяТаблицы, Успешно) Экспорт
	
	Статус = ПомощникТестированияРат.Статус();
	Результат = РатМетаданные.МенеджерТаблицы(ИмяТаблицы, Статус);
	
	Если Успешно Тогда
		ЮТест.ОжидаетЧто(Статус, "Статус для " + ИмяТаблицы)
			.Свойство("Успешно").ЭтоИстина("успешен")
			.Что(Результат, "Менеджер для " + ИмяТаблицы)
			.Существует();
	Иначе
		ЮТест.ОжидаетЧто(Статус, "Статус для " + ИмяТаблицы)
			.Свойство("Успешно").ЭтоЛожь("провелен")
			.Что(Результат, "Менеджер для " + ИмяТаблицы)
			.НеСуществует();
	КонецЕсли;
		
КонецПроцедуры

Процедура ТаблицыДвижений() Экспорт
	
	ЮТест.ОжидаетЧто(РатМетаданные.ТаблицыДвижений("Документ.Ф_Чек"), "Движения чека")
		.ИмеетДлину(1)
		.Свойство("Ф_ОстаткиТоваров").Равно("РегистрНакопления.Ф_ОстаткиТоваров");
	
КонецПроцедуры

Процедура ПолноеИмяТаблицыДвижений() Экспорт
	
	ЮТест.ОжидаетЧто(РатМетаданные.ПолноеИмяТаблицыДвижений("Документ.Ф_Чек", "Ф_ОстаткиТоваров"), "Существующий регистр")
		.Равно("РегистрНакопления.Ф_ОстаткиТоваров");
	
	ЮТест.ОжидаетЧто(РатМетаданные.ПолноеИмяТаблицыДвижений("Документ.Ф_Чек", "Ф_ОстаткиТоваров2"), "Несуществующий регистр")
		.ЭтоНеопределено();
	
КонецПроцедуры

Процедура РазложитьИмяТаблицы() Экспорт
	
	Варианты = ЮТТестовыеДанные.ТаблицаMarkDown(
		"| Имя                              | Тип               | Вид             |
		||----------------------------------|-------------------|-----------------|
		|| Справочник.Ф_Номенклатура      | Справочник        | Ф_Номенклатура|
		|| Документ.Ф_Чек                 | Документ          | Ф_Чек         |
		|| Перечисление.Ф_ВидыОпераций    | Перечисление      | Ф_ВидыОпераций|
		|| РегистрыСведений.Ф_КомментарииПоОбъекту | РегистрСведений   | Ф_КомментарииПоОбъекту |
		|| РегистрНакопления.Ф_ОстаткиТоваров | РегистрНакопления | Ф_ОстаткиТоваров |
		|| Справочники.Ф_Номенклатура2   | Справочник        | Ф_Номенклатура2|");
	
	Для Каждого Вариант Из Варианты Цикл
		
		Результат = РатМетаданные.РазложитьИмяТаблицы(Вариант.Имя);
		ЮТест.ОжидаетЧто(Результат, Вариант.Имя)
			.ИмеетТип("Структура")
			.Свойство("ИмяТипа").Равно(Вариант.Тип)
			.Свойство("ИмяВида").Равно(Вариант.Вид)
			.Свойство("Тип.Имя").Равно(Вариант.Тип);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТаблицаСодержитПредопределенный(Имя, Предопределенный, ОжидаемыйРезультат) Экспорт
		
	Результат = РатМетаданные.ТаблицаСодержитПредопределенный(Имя, Предопределенный);
	ЮТест.ОжидаетЧто(Результат, "Проверка наличия предопределенного элемента " + Предопределенный + " в таблице " + Имя)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ДоступноРедактирование() Экспорт
	
	Варианты = Новый Массив;
	Варианты.Добавить(Новый Структура("Имя, Результат", "Справочник.Валюты", Истина));
	Варианты.Добавить(Новый Структура("Имя, Результат", "Справочник", Истина));
	Варианты.Добавить(Новый Структура("Имя, Результат", "Документ.ЧекККМ", Истина));
	Варианты.Добавить(Новый Структура("Имя, Результат", "РегистрНакопления.КассовыеСмены", Ложь));
	Варианты.Добавить(Новый Структура("Имя, Результат", "РегистрНакопления", Ложь));
	Варианты.Добавить(Новый Структура("Имя, Результат", "Перечисление.КатегорииСМС", Ложь));
	Варианты.Добавить(Новый Структура("Имя, Результат", "ПланВидовХарактеристик.ТипыЗначенийВидовПравДоступа", Истина));
	
	Для Каждого Вариант Из Варианты Цикл
		
		ЮТест.ОжидаетЧто(РатМетаданные.ТипМетаданных(Вариант.Имя), Вариант.Имя)
			.Свойство("Редактирование").Равно(Вариант.Результат);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТаблицаСодержитОбъектныеДанные() Экспорт
	
	Варианты = Новый Массив;
	Варианты.Добавить(Новый Структура("Имя, Результат", "Справочник.Валюты", Истина));
	Варианты.Добавить(Новый Структура("Имя, Результат", "Документ.ЧекККМ", Истина));
	Варианты.Добавить(Новый Структура("Имя, Результат", "РегистрНакопления.КассовыеСмены", Ложь));
	Варианты.Добавить(Новый Структура("Имя, Результат", "Перечисление.КатегорииСМС", Истина));
	Варианты.Добавить(Новый Структура("Имя, Результат", "ПланВидовХарактеристик.ТипыЗначенийВидовПравДоступа", Истина));
	
	Для Каждого Вариант Из Варианты Цикл
		
		Результат = РатМетаданные.ТаблицаСодержитОбъектныеДанные(Вариант.Имя);
		ЮТест.ОжидаетЧто(Результат, Вариант.Имя)
			.Равно(Вариант.Результат, "корректная проверка `ТаблицаСодержитОбъектныеДанные`")
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КлючевыеПоляТаблицы(ИмяТаблицы, Результат) Экспорт
	
	КлючевыеПоля = РатМетаданные.КлючевыеПоляТаблицы(ИмяТаблицы);
	ЮТест.ОжидаетЧто(КлючевыеПоля, "Ключевые поля таблицы " + ИмяТаблицы)
		.Равно(СтрРазделить(Результат, ", ", Ложь));
	
КонецПроцедуры

Процедура СтруктураТаблицы() Экспорт
	
	Описание = РатМетаданные.СтруктураТаблицы("Справочник.Ф_ОбъектыМетаданных");
	ЮТест.ОжидаетЧто(Описание.Реквизиты, "Описание реквизитов справочника `ОбъектыМетаданных`")
		.ИмеетСвойство("Наименование")
		.ИмеетСвойство("Тип")
		.ИмеетСвойство("Предопределенный")
		.ИмеетСвойство("Родитель")
		.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
			.Реквизит("Значение").ИмеетТип("ОписаниеТипов"));
	
	Описание = РатМетаданные.СтруктураТаблицы("РегистрСведений.Ф_ИзмерениеСоставнойРеквизит");
	ЮТест.ОжидаетЧто(Описание, "Описание структуры регистра сведений `ИзмерениеСоставнойРеквизит`")
		.ИмеетСвойство("Реквизиты.ИзмерениеЛюбаяСсылка")
		.ИмеетСвойство("Реквизиты.Значение");
	
	ТипРеквизита = Описание.Реквизиты.Значение;
	ЮТест.ОжидаетЧто(ТипРеквизита.СодержитТип(Тип("Null"))).ЭтоЛожь("отсутствует тип Null");
	ЮТест.ОжидаетЧто(ТипРеквизита.Типы())
		.ИмеетДлину(1, "содержит только одно значени");
	
	ТипРеквизита = Описание.Реквизиты.ИзмерениеЛюбаяСсылка;
	ЮТест.ОжидаетЧто(ТипРеквизита.Типы(), "Составной тип")
		.ИмеетДлинуБольше(5, "содержит много вложенных типов");
	
КонецПроцедуры

Процедура ЭтоТипПеречисления(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТипПеречисления(Тип(ИмяТипа));
	
	ЮТест.ОжидаетЧто(Результат, "Проверка типа перечисления " + ИмяТипа)
		.Равно(ОжидаемыйРезультат);

КонецПроцедуры

Процедура ЭтоТипКлючаЗаписи(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТипКлючаЗаписи(Тип(ИмяТипа));
	ЮТест.ОжидаетЧто(Результат, "Проверка типа ключа записи " + ИмяТипа)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ЭтоРегистрСведений(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоРегистрСведений(Тип(ИмяТипа));
	
	ЮТест.ОжидаетЧто(Результат, "Проверка типа регистра сведений " + ИмяТипа)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ТипыМетаданных() Экспорт
	
	Описание = РатМетаданные.ТипыМетаданных();
	
	КолонкиЭталон = СтрРазделить("Имя, ИмяКоллекции, ОбъектныеДанные, Редактирование, КоллекцииРеквизитов, ТабличныеЧасти, Предопределенные, Поиск", ", ", Ложь);
	КолонкиОписания = РатКоллекции.ВыгрузитьЗначения(Описание.Колонки, "Имя");
	
	ЮТест.ОжидаетЧто(КолонкиОписания, "Колонки таблицы метаданных")
		.Равно(КолонкиЭталон);
	
	ОжидаемыеИмена = Новый Массив;
	ОжидаемыеИмена.Добавить("Справочник");
	ОжидаемыеИмена.Добавить("Документ");
	ОжидаемыеИмена.Добавить("Перечисление");
	ОжидаемыеИмена.Добавить("ПланВидовХарактеристик");
	ОжидаемыеИмена.Добавить("ПланСчетов");
	ОжидаемыеИмена.Добавить("ПланВидовРасчета");
	ОжидаемыеИмена.Добавить("ПланОбмена");
	ОжидаемыеИмена.Добавить("РегистрСведений");
	ОжидаемыеИмена.Добавить("РегистрНакопления");
	ОжидаемыеИмена.Добавить("РегистрБухгалтерии");
	ОжидаемыеИмена.Добавить("РегистрРасчета");
	ОжидаемыеИмена.Добавить("БизнесПроцесс");
	ОжидаемыеИмена.Добавить("Задача");
	ИменаОписания = РатКоллекции.ВыгрузитьЗначения(Описание, "Имя");
	
	ЮТест.ОжидаетЧто(ИменаОписания, "Имена описаных объектов")
		.Равно(ОжидаемыеИмена);
	
КонецПроцедуры

Процедура РеквизитыОбъектаМетаданных() Экспорт
	
	ОписаниеКоллекции = РатМетаданные.ТипыМетаданных().Найти("Справочник", "Имя");
	МетаОбъект = Метаданные.Справочники.Ф_ОбъектыМетаданных;
	Реквизиты = РатМетаданные.РеквизитыОбъектаМетаданных(МетаОбъект, ОписаниеКоллекции);
	
	ИменаРеквизитов = РатКоллекции.ВыгрузитьЗначения(Реквизиты, "Имя");
	ЮТест.ОжидаетЧто(ИменаРеквизитов, "Список реквизитов не соответствует ожиданию")
		.Содержит("Код")
		.Содержит("Наименование")
		.Содержит("Тип")
		.Содержит("Родитель")
		.НеСодержит("Владелец");
	
КонецПроцедуры

Процедура ТипРеквизита(Путь, Тип) Экспорт
	
	ЮТест.ОжидаетЧто(РатМетаданные.ТипРеквизита(Путь))
		.Равно(Тип, "верный тип реквизита");
	
КонецПроцедуры

Процедура ОтборРегистра(ИмяТаблицы, ОжидаемыеКлючевыеПоля) Экспорт
	
	КлючевыеПоля = РатМетаданные.ОтборРегистра(ИмяТаблицы);
	ЮТест.ОжидаетЧто(КлючевыеПоля, "Ключевые поля регистра " + ИмяТаблицы)
		.Равно(ОжидаемыеКлючевыеПоля);
	
КонецПроцедуры

Процедура ЭтоТаблицаПеречисления(ИмяТаблицы, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТаблицаПеречисления(ИмяТаблицы);
	ЮТест.ОжидаетЧто(Результат, "Проверка таблицы перечисления " + ИмяТаблицы)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ЭтоТаблицаДокумента(ИмяТаблицы, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТаблицаДокумента(ИмяТаблицы);
	ЮТест.ОжидаетЧто(Результат, "Проверка таблицы документа " + ИмяТаблицы)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ЭтоТаблицаПланаОбмена(ИмяТаблицы, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТаблицаПланаОбмена(ИмяТаблицы);
	ЮТест.ОжидаетЧто(Результат, "Проверка таблицы плана обмена " + ИмяТаблицы)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ЭтоТаблицаРегистра(ИмяТаблицы, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТаблицаРегистра(ИмяТаблицы);
	ЮТест.ОжидаетЧто(Результат, "Проверка таблицы регистра " + ИмяТаблицы)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ЭтоТаблицаНезависимогоРегистрСведений(ИмяТаблицы, ОжидаемыйРезультат) Экспорт
	
	Результат = РатМетаданные.ЭтоТаблицаНезависимогоРегистрСведений(ИмяТаблицы);
	ЮТест.ОжидаетЧто(Результат, "Проверка независимого регистра сведений " + ИмяТаблицы)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

#КонецОбласти
