//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ПолучитьДанныеСписка")
			.СПараметрами("Справочник/Ф_Номенклатура", Новый Структура("ПометкаУдаления", Ложь))
			.СПараметрами("Справочники/Ф_Номенклатура", , "Наименование")
			.СПараметрами("Документ/Ф_Чек", , , "НомерСмены, ТоварыУслуги")
			.СПараметрами("РегистрыСведений/Ф_КомментарииПоОбъекту")
			.СПараметрами("Перечисления/Ф_ВидыОпераций")
		.ДобавитьТест("ПолучитьДанныеСписка_ОшибкаПараметров")
			.СПараметрами("РазборПараметровЗапроса", 1)
			.СПараметрами("РазборПараметровЗапроса", "1")
			.СПараметрами("РазборПараметровЗапроса", Новый Структура("Номер", 1))
			.СПараметрами("АнализПараметровЗапроса", Новый Структура("Тип", "Справочник"), "Номер")
			.СПараметрами("НеНайденаЗаписьИБ", Новый Структура("Тип", "НетТакого"))
			
		.ДобавитьТест("ПолучитьДанныеСписка_Лимит")
		.ДобавитьТест("ПолучитьЭлемент_Справочник")
		.ДобавитьТест("ПолучитьЭлемент_Документ")
		.ДобавитьТест("ПолучитьЭлемент_Регистр")
		.ДобавитьТест("ПолучитьЭлемент_Ошибки")
		.ДобавитьТест("СоздатьДанные_Справочник")
		.ДобавитьТест("СоздатьДанные_Документ")
		.ДобавитьТест("СоздатьДанные_Регистр")
		.ДобавитьТест("СоздатьДанные_Ошибки")
		.ДобавитьТест("СоздатьДанныеСУказаниемСсылки")
		.ДобавитьТест("ИзменитьДанные")
		.ДобавитьТест("УдалитьДанные")
		.ДобавитьТест("УдалитьДанные_Регистр")
		
		.ДобавитьТест("РасширеннаяФильтрация")
		.ДобавитьТест("МетаданныеТаблицы")
		.ДобавитьТест("ИспользованиеВыражения")
		
		.ДобавитьТестовыйНабор("ИсправлениеОшибок")
			.ДобавитьТест("УдалитьДанныеПоПустомуСоставномуРеквизиту")
			.ДобавитьТест("ОшибкаРазбораНаименования")
			.ДобавитьТест("ИзмененитьЗначениеИзмеренияРегистра")
	;
	КонецПроцедуры

Процедура ПолучитьДанныеСписка(Адрес, Отбор = "!%№", Порядок = "!%№", Поля = "!%№") Экспорт

	Тело = ТелоЗапросаСписка(Отбор, Порядок, Поля);
	СтатусОбработкиЗапроса = ВызовОбработчикаПолученияДанныхСписка(Адрес, Тело);

	ПроверитьРезультат(СтатусОбработкиЗапроса, Неопределено, Неопределено);

КонецПроцедуры

Процедура ПолучитьДанныеСписка_ОшибкаПараметров(Ошибка, Отбор = "!%№", Порядок = "!%№", Поля = "!%№") Экспорт

	ОжидаемаяОшибка = РатПовтИсп.КлассыОшибок()[Ошибка];

	Тело = ТелоЗапросаСписка(Отбор, Порядок, Поля);
	СтатусОбработкиЗапроса = ВызовОбработчикаПолученияДанныхСписка("Справочник/Ф_ОбъектыМетаданных", Тело);

	ПроверитьРезультат(СтатусОбработкиЗапроса, Неопределено, ОжидаемаяОшибка);

КонецПроцедуры

Процедура ПолучитьДанныеСписка_Лимит() Экспорт
	
	// Подготовка данных
	Объект = ЮТест.Данные().СоздатьЭлемент("Справочник.Ф_Номенклатура");
	Конструктор = ЮТест.Данные().КонструкторОбъекта("РегистрСведений.Ф_КомментарииПоОбъекту").Установить("Объект", Объект);
	Период = ЮТест.Данные().СлучайнаяДата();
	КоличествоЭлементов = 101;
	
	Для Инд = 1 По КоличествоЭлементов Цикл
		
		Конструктор.Фикция("Комментарий").Установить("Период", Период + Инд).Записать();
		;
		
	КонецЦикла;
	
	ТелоЗапроса = Новый Структура("limit", КоличествоЭлементов);
	// Действие
	СтатусОбработкиЗапроса = ВызовОбработчикаПолученияДанныхСписка("РегистрСведений/Ф_КомментарииПоОбъекту", ТелоЗапроса);
	
	// Проверки
	ЮТест.ОжидаетЧто(СтатусОбработкиЗапроса.Результат)
		.ИмеетТип("ТаблицаЗначений")
		.ИмеетДлину(КоличествоЭлементов);
	
КонецПроцедуры

Процедура ОшибкаРазбораНаименования() Экспорт
	
	Наименование = "А. и (Б), с-и-д-е-л-и.";
	ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура, Наименование);
	Тело = Новый Структура("filter", Новый Структура);
	Тело.filter.Вставить("Наименование", Наименование);
	СтатусОбработкиЗапроса = ВызовОбработчикаПолученияДанныхСписка("Справочники/Ф_Номенклатура", Тело);
	ПроверитьРезультат(СтатусОбработкиЗапроса, "Проверка ошибки", Неопределено);

КонецПроцедуры

Процедура ПолучитьЭлемент_Справочник() Экспорт
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	ИдентификаторСсылки = Строка(Ссылка.УникальныйИдентификатор());
	Варианты = ЮТест.Варианты("Адрес")
		.Добавить("Справочник/Ф_Номенклатура/"+ ИдентификаторСсылки)
		.Добавить("Справочники/Ф_Номенклатура/" + ИдентификаторСсылки)
		.Добавить("Справочники/Ф_Номенклатура/" + Ссылка.Код)
		.Добавить("Справочники/Ф_Номенклатура/" + Ссылка.Наименование)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
		СтатусОбработкиЗапроса = ВызовОбработчикаПолучитьЗаписьТаблицы(Вариант.Адрес);
		Описание = ТестированиеСервер.Представление(Вариант, , "Вариант");
		ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьЭлемент_Документ() Экспорт
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Документы.Ф_Чек);
	ИдентификаторСсылки = Строка(Ссылка.УникальныйИдентификатор());
	Варианты = ЮТест.Варианты("Адрес")
		.Добавить("Документ/Ф_Чек/"+ ИдентификаторСсылки)
		.Добавить("Документы/Ф_Чек/" + ИдентификаторСсылки)
		.Добавить("Документы/Ф_Чек/" + Ссылка.Номер)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
		СтатусОбработкиЗапроса = ВызовОбработчикаПолучитьЗаписьТаблицы(Вариант.Адрес);
		Описание = ТестированиеСервер.Представление(Вариант, , "Вариант");
		ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьЭлемент_Регистр() Экспорт
	
	Объект = ЮТест.Данные().СоздатьЭлемент(Документы.Ф_Чек);
	Комментарий = Строка(Объект.УникальныйИдентификатор());
	
	ЗаписьРС = РегистрыСведений.Ф_КомментарииПоОбъекту.СоздатьМенеджерЗаписи();
	
	ЗаписьРС.Объект = Объект;
	ЗаписьРС.Период = ТекущаяДатаСеанса();
	ЗаписьРС.Комментарий = Комментарий;
	ЗаписьРС.Записать();
	
	ИдентификаторЗаписи = СтрШаблон("Объект=Документы.Ф_Чек.%1;Период=%2",
									ЗаписьРС.Объект.УникальныйИдентификатор(),
									ПомощникТестированияРат.ДатаISO8601(ЗаписьРС.Период));
	
	ИдентификаторЗаписи2 = СтрШаблон("Объект=Документ.Ф_Чек.%1;Период=%2",
									 ЗаписьРС.Объект.Номер,
									 ПомощникТестированияРат.ДатаISO8601(ЗаписьРС.Период));
	
	Варианты = ЮТест.Варианты("Адрес")
		.Добавить("РегистрСведений/Ф_КомментарииПоОбъекту/"+ ИдентификаторЗаписи)
		.Добавить("РегистрыСведений/Ф_КомментарииПоОбъекту/" + ИдентификаторЗаписи)
		.Добавить("РегистрыСведений/Ф_КомментарииПоОбъекту/" + ИдентификаторЗаписи2)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
		СтатусОбработкиЗапроса = ВызовОбработчикаПолучитьЗаписьТаблицы(Вариант.Адрес);
		Описание = ТестированиеСервер.Представление(Вариант, , "Вариант");
		ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьЭлемент_Ошибки() Экспорт
	
	Классы = РатПовтИсп.КлассыОшибок();
	Варианты = ЮТест.Варианты("Адрес, КлассОшибки")
		.Добавить("Документ/Ф_Чек/1", Классы.НеНайденаЗаписьИБ)
		.Добавить("РегистрыСведений/Ф_КомментарииПоОбъекту/Объект=123;Период=2025-04-14T11:37:08", Классы.АнализПараметровЗапроса)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
		СтатусОбработкиЗапроса = ВызовОбработчикаПолучитьЗаписьТаблицы(Вариант.Адрес);
		Описание = ТестированиеСервер.Представление(Вариант, , "Вариант");
		ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, Вариант.КлассОшибки);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьДанные_Справочник() Экспорт
	
	Описание = "Справочник без табличной части";
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("Справочник/Ф_Номенклатура", 
		ТелоДанныеОбъекта(Новый Структура("Наименование", "Рупия")));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, Описание);
	
	Описание = "Справочник с табличной частью";
	
	Строки = Новый Массив;
	Строки.Добавить(Новый Структура("ИмяРеквизита, ПредставлениеТипа", "1", "1.1"));
	Строки.Добавить(Новый Структура("ИмяРеквизита, ПредставлениеТипа", "2", "2.1"));
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("Справочник/Ф_ОбъектыМетаданных", 
		ТелоДанныеОбъекта(Новый Структура("Наименование, Реквизиты", "Рупия", Строки)));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, Описание);
	
	Описание = "Без тела";
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("Справочник/Ф_Номенклатура", 
		ТелоДанныеОбъекта(Новый Структура));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, Описание);
	
КонецПроцедуры

Процедура СоздатьДанные_Документ() Экспорт
	
	Описание = "Документ с табличной частью";
	Товар = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	ИдентификаторТовара = Строка(Товар.УникальныйИдентификатор());
	
	Данные = Новый Структура;
	Данные.Вставить("НомерСмены", 1);
	Данные.Вставить("ВидОперации", Перечисления.Ф_ВидыОпераций.Приход);
	Данные.Вставить("ТоварыУслуги", Новый Массив);
	Данные.ТоварыУслуги.Добавить(Новый Структура("Номенклатура, Количество, Цена, Сумма", ИдентификаторТовара, 1, 1, 1));
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("Документ/Ф_Чек", 
		ТелоДанныеОбъекта(Данные));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, Описание);
	
КонецПроцедуры

Процедура СоздатьДанные_Регистр() Экспорт
	
	Описание = "Запись периодического регистра";
	Ссылка = ЮТест.Данные().СоздатьДокумент(Документы.Ф_Чек);
	ИдентификаторСсылки = Строка(Ссылка.УникальныйИдентификатор());
	
	Данные = Новый Структура("Объект, Период, Комментарий",
							 "Документы.Ф_Чек." + ИдентификаторСсылки,
							 "2025-04-14T11:37:08",
							 "123");
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("РегистрСведений/Ф_КомментарииПоОбъекту", 
		ТелоДанныеОбъекта(Данные));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, Описание);
	
КонецПроцедуры

Процедура СоздатьДанные_Ошибки() Экспорт
	
	Классы = РатПовтИсп.КлассыОшибок();
	
	Ссылка = ЮТест.Данные().СоздатьДокумент(Документы.Ф_Чек);
	ИдентификаторСсылки = Строка(Ссылка.УникальныйИдентификатор());
	
	//---------------------------------
	Описание = "Не указан ключевой реквизит регистра";
	Данные = Новый Структура("Объект, Комментарий",
							 "Документы.Ф_Чек." + ИдентификаторСсылки,
							 "123");
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("РегистрСведений/Ф_КомментарииПоОбъекту", 
		ТелоДанныеОбъекта(Данные));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(СтатусОбработкиЗапроса, Описание, Классы.АнализПараметровЗапроса);
	
	//---------------------------------
	Описание = "Ошибка приведения типов";
	
	Данные = Новый Структура("Объект, Пеирод",
							 "Документы.Ф_Чек." + ИдентификаторСсылки,
							 "123");
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("РегистрСведений/Ф_КомментарииПоОбъекту", 
		ТелоДанныеОбъекта(Данные));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(СтатусОбработкиЗапроса, Описание, Классы.АнализПараметровЗапроса);
	
	//---------------------------------
	Описание = "Некорректное тело";
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("РегистрСведений/Ф_КомментарииПоОбъекту", 
		ТелоДанныеОбъекта(1));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(СтатусОбработкиЗапроса, Описание, Классы.АнализПараметровЗапроса);
	
	//---------------------------------
	Описание = "Не указан тип составного реквиззита";
	
	Данные = Новый Структура("Объект, Пеирод",
							 ИдентификаторСсылки,
							 "123");
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("РегистрСведений/Ф_КомментарииПоОбъекту", 
		ТелоДанныеОбъекта(Данные));
	ПомощникТестированияРат.ПроверитьРезультатОшибка(СтатусОбработкиЗапроса, Описание, Классы.АнализПараметровЗапроса);
	
КонецПроцедуры

Процедура СоздатьДанныеСУказаниемСсылки() Экспорт
	
	Описание = "Запись с указанием ссылки нового";
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	Запись = Новый Структура("Ссылка, Наименование", Идентификатор, "Рупия2");
	
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("Справочник/Ф_Номенклатура", Новый Структура("data", Запись));
	ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, Неопределено);
	
	ЮТест.ОжидаетЧто(СтатусОбработкиЗапроса.Результат, Описание)
		.ИмеетТип("СправочникСсылка.Ф_Номенклатура");
	ЮТест.ОжидаетЧто(Строка(СтатусОбработкиЗапроса.Результат.УникальныйИдентификатор()), Описание)
		.Равно(Идентификатор);
	
КонецПроцедуры

Процедура ИзменитьДанные() Экспорт
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	
	ТаблицаВариантов = СтрШаблон("| Тип        | Вид              | КодОбъекта | КодОшибки               |
								 ||------------|------------------|------------|-------------------------|
								 || Справочник | Ф_Склады       | йцук       | НеНайденаЗаписьИБ       |
								 || Справочник | Ф_Номенклатура | %1         |                         |
								 || Справочник | Ф_Номенклатура | %1         | НеНайденаЗаписьИБ       |
								 |", Ссылка.Код);
	Варианты = ЮТТестовыеДанные.ТаблицаMarkDown(ТаблицаВариантов);
	
	Классы = РатОбщий.КлассыОшибок();
	
	Для Каждого Вариант Из Варианты Цикл
		
		Адрес = СтрШаблон("%1/%2/%3", Вариант.Тип, Вариант.Вид, Вариант.КодОбъекта);
		Тело = Новый Структура("Код, Наименование", "Тестовый код", "Тестовое наименование");
		
		Статус = ВызовОбработчикаИзменитьЗаписьТаблицы(Адрес, Новый Структура("data", Тело));
		
		Описание = ТестированиеСервер.Представление(Вариант, , "Вариант");
		
		Если Не ПустаяСтрока(Вариант.КодОшибки) Тогда
			КлассОшибки = Классы[Вариант.КодОшибки];
		Иначе
			КлассОшибки = Неопределено;
		КонецЕсли;
		
		ПроверитьРезультат(Статус, Описание, КлассОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДанные() Экспорт

	Варианты = Новый Массив;
	Варианты.Добавить("Справочник.Ф_Номенклатура");
	Варианты.Добавить("ПланВидовХарактеристик.Ф_ПВХ");
	Варианты.Добавить("Документ.Ф_Чек");
	
	Для Каждого Вариант Из Варианты Цикл
		
		Статус = ПомощникТестированияРат.Статус();
		Менеджер = РатМетаданные.МенеджерТаблицы(Вариант, Статус);
		
		Если СтрНачинаетсяС(Вариант, "Документ") Тогда
			Ссылка = ЮТТестовыеДанные.СоздатьДокумент(Менеджер);
		Иначе
			Ссылка = ЮТест.Данные().СоздатьЭлемент(Менеджер);
		КонецЕсли;
		
		Адрес = СтрЗаменить(Вариант, ".", "/") + "/" + Ссылка.УникальныйИдентификатор();
		Статус = ВызовОбработчикаУдалитьДанные(Адрес);
		
		ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Удаление " + Вариант);
		ЮТест.ОжидаетЧто(Ссылка, "Проверка удаленного объекта " + Вариант)
			.Свойство("ПометкаУдаления").ЭтоИстина();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДанные_Регистр() Экспорт
	
	Объект = ЮТест.Данные().СоздатьЭлемент(Справочники.Ф_Номенклатура);
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(РегистрыСведений.Ф_КомментарииПоОбъекту)
		.Установить("Объект", Объект)
		.ФикцияОбязательныхПолей();
	
	КлючЗаписи = Конструктор.Записать();
	
	Период2 = ТекущаяДатаСеанса() + 999999;
	Конструктор.Установить("Период", Период2)
		.Записать();
	
	ПредикатКлюч = ЮТест.Предикат()
		.Реквизит("Объект").Равно(КлючЗаписи.Объект)
		.Реквизит("Период").Равно(КлючЗаписи.Период)
		.Получить();
	ПредикатОбъект = ЮТест.Предикат()
		.Реквизит("Объект").Равно(КлючЗаписи.Объект)
		.Получить();
	ЮТест. ОжидаетЧтоТаблицаБазы("РегистрСведений.Ф_КомментарииПоОбъекту")
		.СодержитЗаписи(ПредикатКлюч, "Первоначальная запись");
	
	// -----------------------------
	Описание = "Удаление записи регистра по неподходящему отбору";
	Адрес = СтрШаблон("РегистрыСведений/Ф_КомментарииПоОбъекту/Объект=Справочник.Ф_Номенклатура.%1;Период=2030-01-01",
					  Объект.УникальныйИдентификатор());
	Статус = ВызовОбработчикаУдалитьДанные(Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест. ОжидаетЧтоТаблицаБазы("РегистрСведений.Ф_КомментарииПоОбъекту")
		.СодержитЗаписи(ПредикатКлюч, Описание);
	
	// -----------------------------
	Описание = "Удаление записи регистра по полному ключу";
	Адрес = СтрШаблон("РегистрыСведений/Ф_КомментарииПоОбъекту/Объект=Справочник.Ф_Номенклатура.%1;Период=%2",
					  Объект.УникальныйИдентификатор(), ПомощникТестированияРат.ДатаISO8601(КлючЗаписи.Период));
	Статус = ВызовОбработчикаУдалитьДанные(Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, Описание);
	ЮТест. ОжидаетЧтоТаблицаБазы("РегистрСведений.Ф_КомментарииПоОбъекту")
		.НеСодержитЗаписи(ПредикатКлюч, Описание)
		.СодержитЗаписи(ПредикатОбъект, Описание);
	
	// -----------------------------
	Описание = "Удаление записи регистра по неполному ключу";
	Адрес = СтрШаблон("РегистрыСведений/Ф_КомментарииПоОбъекту/Объект=Справочник.Ф_Номенклатура.%1",
					  Объект.УникальныйИдентификатор());
	Статус = ВызовОбработчикаУдалитьДанные(Адрес);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, Описание, РатОбщий.КлассыОшибок().Десериализация);
	
КонецПроцедуры

Процедура МетаданныеТаблицы() Экспорт
	
	Адрес = "Документы/Ф_Чек/Метаданные";
	Статус = ВызватьОбработчик("МетаданныеТаблицы", Адрес);
	ПроверитьРезультат(Статус, "Метаданные таблицы", Неопределено);
	
	ЮТест.ОжидаетЧто(Статус.Результат)
		.Свойство("Имя").Равно("Ф_Чек")
		.Свойство("Представление")
		.Свойство("Реквизиты").ИмеетДлину(8)
		.Свойство("КлючевыеРеквизиты")
			.ИмеетДлину(1)
			.Содержит("Ссылка")
		.Свойство("ТабличныеЧасти")
			.ИмеетДлину(1);
	
КонецПроцедуры

Процедура УдалитьДанныеПоПустомуСоставномуРеквизиту() Экспорт
	
	Данные = ЮТест.Данные().КонструкторОбъекта(РегистрыСведений.Ф_ИзмерениеСоставнойРеквизит)
		.Фикция("ИзмерениеЛюбаяСсылка", , Тип("СправочникСсылка.Ф_Номенклатура"))
		.ФикцияРеквизитов("ИзмерениеЧисло, Значение")
		.ДобавитьЗапись()
		.ДанныеОбъекта();
	
	Адрес = СтрШаблон("РегистрСведений/Ф_ИзмерениеСоставнойРеквизит/ИзмерениеЛюбаяСсылка=Справочник.Ф_Номенклатура.%1;ИзмерениеЧисло=%2;ИзмерениеСоставное=null",
					  Данные.ИзмерениеЛюбаяСсылка.УникальныйИдентификатор(),
					  Формат(Данные.ИзмерениеЧисло, "ЧГ=0;"));
	
	Статус = ВызовОбработчикаУдалитьДанные(Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
КонецПроцедуры

Процедура РасширеннаяФильтрация() Экспорт
	
	Данные = Новый Массив;
	
	Идентификатор = ЮТест.Данные().СлучайнаяСтрока();
	ИмяРеквизита = ЮТест.Данные().СлучайнаяСтрока();
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(Справочники.Ф_ОбъектыМетаданных)
		.Фикция("Наименование")
		.ТабличнаяЧасть("Реквизиты")
			.ДобавитьСтроку()
				.Установить("ИмяРеквизита", ИмяРеквизита);
	Данные.Добавить(Конструктор.Записать());
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(Справочники.Ф_ОбъектыМетаданных)
		.Установить("Наименование", Идентификатор)
		.ТабличнаяЧасть("Реквизиты")
			.ДобавитьСтроку()
				.Фикция("ИмяРеквизита");
	
	Данные.Добавить(Конструктор.Записать());
	
	Конструктор.Установить("ИмяРеквизита", ИмяРеквизита);
	Данные.Добавить(Конструктор.Записать());
	
	Адрес = "Справочник/Ф_ОбъектыМетаданных";
	
	Варианты = ЮТест.Варианты("Реквизит, Условие, Значение, РазмерРезультата")
		.Добавить("Наименование", Неопределено, Идентификатор, 2)
		.Добавить("Реквизиты.ИмяРеквизита", Неопределено, ИмяРеквизита, 2)
		.Добавить("Наименование", "НачинаетсяС", "123", 0)
		.Добавить("Наименование", "ЗаканчиваетсяНа", "123", 0)
		.Добавить("Ссылка", "ВГруппе", Данные[0], 1)
		.Добавить("Наименование", "ВСписке", ЮТКоллекции.ЗначениеВМассиве(Идентификатор), 2)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
		Тело = Фильтр(Вариант.Реквизит, Вариант.Значение, , Вариант.Условие);
		Описание = СтрШаблон("%1 %2 %3", Вариант.Реквизит, Вариант.Условие, Вариант.Значение);
		
		ПроверитьФильтрацию(Адрес, Тело, Описание, Вариант.РазмерРезультата);
	КонецЦикла;
	
	Тело = Фильтр("Реквизиты.ИмяРеквизита", ИмяРеквизита, , "НеРавно");
	Фильтр("Наименование", Идентификатор, , "Равно", Тело);
	ПроверитьФильтрацию(Адрес, Тело, "Получение списка составное условие", 1);
	
	Тело = Фильтр("Реквизиты.ИмяРеквизита", ИмяРеквизита, , "НеРавно");
	Фильтр("Наименование", ЮТКоллекции.ЗначениеВМассиве(Идентификатор), , "ВСписке", Тело);
	ПроверитьФильтрацию(Адрес, Тело, "Получение списка составное условие", 1);
	
	Фильтр("Наименование", Идентификатор, , "ВСписке", Тело);
	ПроверитьФильтрацию(Адрес, Тело, "Получение списка составное условие", 1);
	
	Фильтр("Наименование",
		   ЮТКоллекции.ЗначениеВМассиве(Новый Структура("value, type", Идентификатор, "string")),
		   ,
		   "ВСписке",
		   Тело);
	ПроверитьФильтрацию(Адрес, Тело, "Получение списка составное условие", 1);
	
КонецПроцедуры

Процедура ИзмененитьЗначениеИзмеренияРегистра() Экспорт
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(РегистрыСведений.Ф_ПримитивныеИзмерения)
		.ФикцияРеквизитов("Число, Строка, Дата, Булево, УникальныйИдентификатор");
	
	Данные = Конструктор.ДанныеОбъекта();
	Ключ = Конструктор.Записать();
	
	Адрес = СтрШаблон("РегистрСведений/Ф_ПримитивныеИзмерения/Число=%1;Строка=%2;Дата=%3", 
		Формат(Ключ.Число, "ЧГ=0;"),
		Ключ.Строка,
		Формат(Ключ.Дата, "ДФ=yyyy-MM-ddTHH:mm:ss;"));
	
	НовыеДанные = ЮТКоллекции.СкопироватьСтруктуру(Данные);
	НовыеДанные.Число = НовыеДанные.Число + 1;
	
	Статус = ВызовОбработчикаИзменитьЗаписьТаблицы(Адрес, Новый Структура("data", Новый Структура("Число", НовыеДанные.Число)));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус);
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.Ф_ПримитивныеИзмерения")
		.НеСодержитЗаписи(ЮТест.Предикат(Данные));
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.Ф_ПримитивныеИзмерения")
		.СодержитЗаписи(ЮТест.Предикат(НовыеДанные));
	
КонецПроцедуры

Процедура ИспользованиеВыражения() Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Код", "Вычислить(1 + 2)");
	СтатусОбработкиЗапроса = ВызовОбработчикаСоздатьЗаписьТаблицы("Справочник/Ф_Номенклатура", 
																  Новый Структура("data", Данные));
	ПроверитьРезультат(СтатусОбработкиЗапроса, Неопределено, Неопределено);
	
	ЮТест.ОжидаетЧто(СтатусОбработкиЗапроса.Результат)
		.Свойство("Код").Равно("3");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызовОбработчикаПолученияДанныхСписка(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("СписокДанныхТаблицы", Адрес, Тело);

КонецФункции

Функция ВызовОбработчикаПолучитьЗаписьТаблицы(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("ПолучитьЗаписьТаблицы", Адрес, Тело);

КонецФункции

Функция ВызовОбработчикаСоздатьЗаписьТаблицы(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("СоздатьЗаписьТаблицы", Адрес, Тело);

КонецФункции

Функция ВызовОбработчикаИзменитьЗаписьТаблицы(Адрес, Тело = Неопределено)

	Возврат ВызватьОбработчик("ИзменитьЗаписьТаблицы", Адрес, Тело);

КонецФункции

Функция ВызовОбработчикаУдалитьДанные(Адрес)

	Возврат ВызватьОбработчик("УдалитьЗаписьТаблицы", Адрес);

КонецФункции

Функция ВызватьОбработчик(Обработчик, Адрес, Тело = Неопределено)
	
	Возврат ПомощникТестированияРат.ВызватьОбработчик(РатИнформационнаяБазаСервис, Обработчик, Адрес, Тело);
	
КонецФункции

Процедура ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, КлассОшибки)

	Если Не ЗначениеЗаполнено(КлассОшибки) Тогда
		ПомощникТестированияРат.ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, Описание);
	Иначе
		ПомощникТестированияРат.ПроверитьРезультатОшибка(СтатусОбработкиЗапроса, Описание, КлассОшибки);
	КонецЕсли;

КонецПроцедуры

Функция НастройкаОповещенийПользователя() Экспорт
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ПериодичностьЗапуска", 60);
	Настройки.Вставить("ВремяНачала", '00010101');
	Настройки.Вставить("ВремяОкончания", КонецДня('00010101'));
	
	Настройки.Вставить("Понедельник", Истина);
	Настройки.Вставить("Вторник", Истина);
	Настройки.Вставить("Среда", Истина);
	Настройки.Вставить("Четверг", Ложь);
	Настройки.Вставить("Пятница", Истина);
	Настройки.Вставить("Суббота", Истина);
	Настройки.Вставить("Воскресенье", Истина);
	
	Возврат Настройки;
	
КонецФункции

Функция Фильтр(Реквизит, Значение, Тип = Неопределено, Условие = Неопределено, Тело = Неопределено)

	Если Тело = Неопределено Тогда
		Тело = Новый Структура("filter", Новый Массив);
	КонецЕсли;

	Предикат = Новый Структура("key, value, type, condition", Реквизит, Значение, Тип, Условие);
	Тело.filter.Добавить(Предикат);

	Возврат Тело;

КонецФункции

Процедура ПроверитьФильтрацию(Адрес, Тело, Описание, ОжидаемоеКоличество)
	
	СтатусОбработкиЗапроса = ВызовОбработчикаПолученияДанныхСписка(Адрес, Тело);
	ПроверитьРезультат(СтатусОбработкиЗапроса, Описание, Неопределено);
	
	ЮТест.ОжидаетЧто(СтатусОбработкиЗапроса, Описание + ". Проверка результата")
		.Свойство("Результат").ИмеетДлину(ОжидаемоеКоличество);
	
КонецПроцедуры

Функция ТелоДанныеОбъекта(ДанныеОбъекта)
	
	Возврат Новый Структура("data", ДанныеОбъекта);
	
КонецФункции

Функция ТелоЗапросаСписка(Отбор = "!%№", Порядок = "!%№", Поля = "!%№")
	
	Тело = Новый Структура;
	
	Если Отбор <> "!%№" Тогда
		Тело.Вставить("filter", Отбор);
	КонецЕсли;
	
	Если Порядок <> "!%№" Тогда
		Тело.Вставить("order", СтрРазделить(Порядок, ", ", Ложь));
	КонецЕсли;
	
	Если Поля <> "!%№" Тогда
		Тело.Вставить("fields", СтрРазделить(Поля, ", ", Ложь));
	КонецЕсли;
	
	Возврат Тело;
	
КонецФункции

#КонецОбласти
